[
  {
    "title": "Scheming Hutt Gangster",
    "height": "3.9 meters",
    "species": "Hutt",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/zirothehutt_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Ziro the Hutt ",
    "gender": "",
    "homeworld": "",
    "affiliation": "Criminal",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/zirothehutt_detail.png",
    "biography": "Jabba the Hutt's Uncle Ziro conspired with Count Dooku to kidnap Jabba's son Rotta, reasoning that when the Jedi sent to retrieve Rotta died, the Republic would be forced to apprehend Jabba, leading to Ziro gaining control of their clan.\nWhen the conspiracy unraveled, Ziro was imprisoned on Coruscant. Cad Bane freed him and turned him over to the Hutt Council, who feared that Ziro might tell the Republic of their many dirty dealings. Ziro escaped the Hutts, but could not outrun his past."
  },
  {
    "title": "Commander of the Resolute",
    "height": "1.81 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/yularen_thumb.jpg",
    "vehicle": "Jedi cruiser",
    "weapon": "",
    "name": "Admiral Wulff Yularen",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/yularen_detail.png",
    "biography": "An admiral in the Republic's service, Yularen served gallantly in the Clone Wars, commanding a Jedi Cruiser in many campaigns against Separatist forces.\nYularen was assigned to serve with the Jedi General Anakin Skywalker, and the rigid officer and the impulsive Jedi made for an odd combination. Yularen admired Anakin's bravery and instincts in battle while deploring his recklessness and willingness to interpret orders creatively -- or ignore them altogether."
  },
  {
    "title": "Size Matters Not",
    "height": ".66 meters",
    "species": "Unknown",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/yoda_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Yoda",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Jedi",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/yoda_detail.png",
    "biography": "The Grand Master of the Jedi Council, Yoda has trained Jedi for over 800 years. He is wise and powerful in the ways of the Force, though his small size causes many to underestimate him. Yoda prefers meditation and reflection, spending much time pondering the mysteries of the Force. In his long lifetime, he has witnessed the decay of the Galactic Republic, and saw the Jedi Order transform from peacekeepers to battlefield commanders in the Clone Wars. When he must, Yoda wields his lightsaber and becomes a whirling warrior of great speed and agility. A stern instructor, Yoda nonetheless has a mischievous sense of humor. With the rise of the Galactic Empire, Yoda fled into exile and awaited the arrival of a new Jedi student to rekindle a new hope in the galaxy."
  },
  {
    "title": "Jedi Master",
    "height": ".61 meters",
    "species": "Unknown",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/yaddle_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Yaddle",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/yaddle_detail.png",
    "biography": "The quiet Yaddle was a member of the same mysterious species as the revered Jedi Master Yoda. Yaddle sat on the Jedi Council with her fellow green-skinned diminutive Force-user. By the time of the Clone Wars, she was no longer on the Council."
  },
  {
    "title": "Ewok Scout",
    "height": "0.8 meters",
    "species": "Ewok",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/wicket_thumb.jpg",
    "vehicle": "",
    "weapon": "Spear, sling",
    "name": "Wicket W. Warrick",
    "gender": "Male",
    "homeworld": "Endor",
    "affiliation": "Rebel Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/wicket_detail.png",
    "biography": "Wicket W. Warrick was the brave young Ewok who willingly joined the Rebellion and aided in the battle against the Empire on the forest moon of Endor. Even before he encountered the Rebels, Wicket had devised methods for defeating the Imperial machines, plans which were implemented after the Ewok befriended Princess Leia and recruited his tribe to the Alliance's cause. During the Battle of Endor, Wicket fought valiantly alongside his new allies."
  },
  {
    "title": "Veteran of Ryloth",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/waxer_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster rifle",
    "name": "Waxer",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/waxer_detail.png",
    "biography": "Waxer served as part of Ghost Company, under the command of Clone Commander Cody during the campaigns to retake Ryloth and Geonosis. Waxer and Boil were often an inseparable pair, and together formed a recon team scouting the abandoned Twi'lek village of Nabat. There, they found a young girl named Numa, the sole survivor of a Separatist assault. Though the hard-edged Boil at first didn't want anything to do with the little girl, Waxer was compassionate and decided to protect her well-being. Numa proved extremely resourceful, guiding Waxer and Boil through underground passages that allowed them to bypass Separatist forces."
  },
  {
    "title": "Toydarian Junk Dealer",
    "height": "1.37 meters",
    "species": "Toydarian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/watto_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Watto",
    "gender": "Male",
    "homeworld": "Tatooine",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/watto_detail.png",
    "biography": "Watto was a Toydarian junk dealer in Mos Espa who bought Shmi Skywalker and her son Anakin from Gardulla the Hutt. An inveterate gambler, he sponsored Anakin in several Podraces, but often bet against his own slave, who was talented but inexperienced.\nWatto lost Anakin to Qui-Gon Jinn in a wager on the Boonta Eve race. Years later, he sold Shmi to the moisture farmer Cliegg Lars."
  },
  {
    "title": "Foreman of the Techno Union",
    "height": "1.98 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/wattambor_thumb.jpg",
    "vehicle": "Techno Union starship",
    "weapon": "",
    "name": "Wat Tambor",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Techno Union, Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/wattambor_detail.png",
    "biography": "The foreman of the Techno Union, Wat Tambor was one of the original and most fervent Separatist leaders, pledging his loyalty and his battle droid armies to Count Dooku at a pivotal meeting on Geonosis.\nLater in the war, Tambor was appointed emir of Ryloth. His occupation was a cruel one, in which Tambor stripped the Twi'leks of whatever valuables he could find, then bombed their villages."
  },
  {
    "title": "Clone Pilot",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/warthog_thumb.jpg",
    "vehicle": "Clone Z-95 starfighter, V-19 Torrent interceptors, Republic attack gunship",
    "weapon": "",
    "name": "Warthog",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/warthog_detail.png",
    "biography": "A veteran clone pilot of many starfighter engagements, Warthog was highly skilled in combat operations. He was comfortable behind the stick of a V-19 Torrent Interceptor, a Z-95 Headhunter, or a Republic attack gunship. He piloted in the thick of combat alongside commanding officer, General Plo Koon."
  },
  {
    "title": "Underfoot Predator",
    "height": "Tentacles can form a 7-meter radius",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/vixus_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "vixus",
    "gender": "",
    "homeworld": "Umbara",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/vixus_detail.png",
    "biography": "The dense shadows that cling like a fog to Umbara's surface can cause a traveler to absentmindedly step into a tangle of vines, and it is then too late to escape the clutches of a vixus creature. The vines are the tentacles of the beast. Seven ropy limbs stretch out from a dome-shaped mouth, and smaller, secondary tentacles fill the gaps between these larger arms. Caught within the grip of a tentacle, the prey thrashes helplessly as it is drawn towards the beast's mouth -- the only visible portion of the creature's underground body. As the sharp teeth part, rays of light shine from within, briefly illuminating the poor victim's final moments. One final tentacle, pink and well muscled, reaches from within the vixus' maw, capped with a three-taloned grasper, to grab the squirming meal deeper into the creature's tooth-lined gullet."
  },
  {
    "title": "Leader of the Republic",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/valorum_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Supreme Chancellor Valorum",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/valorum_detail.png",
    "biography": "A well-meaning civil servant whose chancellorship was hampered by corruption in the Senate and bureaucratic snarls, Valorum secretly turned to the Jedi Knights for help breaking the Trade Federation's blockade of Naboo.\nBut Valorum was betrayed by Naboo's Senator Palpatine, who maneuvered Queen Amidala into asking the Senate for a no-confidence vote in the Supreme Chancellor's leadership. A stunned Valorum was removed from office in favor of Palpatine."
  },
  {
    "title": "Acrobatic Frenk",
    "height": "2.11 meters",
    "species": "Frenk",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/twazzi_thumb.jpg",
    "vehicle": "",
    "weapon": "Long-barreled blaster rifle and blaster pistol",
    "name": "Twazzi",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/twazzi_detail.png",
    "biography": "A lithe, acrobatic Frenk, Twazzi's limber agility earned the praise of so vaunted a witness as Chancellor Valorum. As a bounty hunter, Twazzi used her flexibility and balance to good effect, outmaneuvering opponents and positioning herself in sniping positions that would be impossible for most humanoids."
  },
  {
    "title": "Rookie Clone Trooper",
    "height": "1.83 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tup_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster rifle",
    "name": "Tup",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tup_detail.png",
    "biography": "A rookie clone trooper in the 501st Legion, Tup acclimated well within the ranks of seasoned veterans. Unlike some of the newer clones, like Dogma, who seemed wound a little too tight, Tup was far more willing to learn from his brothers' experiences. Tup could be distinguished by the teardrop shaped tattoo on his face, and the matching markings on his helmet. He served during the grueling campaign to retake the shadowy planet Umbara, under the command of the fierce General Pong Krell."
  },
  {
    "title": "Ming Po Villager",
    "height": "1.67 meters",
    "species": "Ming Po",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tryla_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Tryla",
    "gender": "Female",
    "homeworld": "Carlac",
    "affiliation": "Ming Po villager",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tryla_detail.png",
    "biography": "When the nomadic Death Watch army arrived on the peaceful planet of Carlac, they intruded in the towns of the native Ming Po. Under Pre Vizsla's command, the Death Watch kidnapped many defenseless natives, forcing them to serve their needs as they set up a temporary base of operations. Not even Tryla, the grand-daughter of Chieftain Peiter was spared. Tryla befriended Ahsoka Tano, a Jedi hidden in their midst, but did not live long enough to see her town liberated."
  },
  {
    "title": "Techo-Service Droid",
    "height": ".66 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/todo360_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Todo 360",
    "gender": "",
    "homeworld": "Vertseth",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/todo360_detail.png",
    "biography": "Cad Bane's techno-service droid had many built in gadgets that made him incredibly useful, but he also had an attitude to match. Always willing to do his duty, Todo was a hard worker and would make sure to remind you of that fact, especially if you called him a butler droid."
  },
  {
    "title": "Trusty Snow Lizard",
    "height": "1.3 to 2 meters tall at the shoulder",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tauntaun_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "tauntaun",
    "gender": "",
    "homeworld": "Hoth",
    "affiliation": "Rebel Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tauntaun_detail.png",
    "biography": "Tauntauns are a species of snow lizard found roaming the windswept snow plains of Hoth. The Rebel Alliance domesticated the swift creature during their stay on the ice planet, and used the animals for patrol duties outside Echo Base. The animals came in useful as the Rebel technicians had difficulty adapting their repulsorlift speeders to the subzero temperatures. Though tauntauns are sure-footed and well equipped to handle Hoth's daytime temperature, the chilling extremes of a Hoth night will prove deadly."
  },
  {
    "title": "Leader of the Gungan Grand Army",
    "height": "2.24 meters",
    "species": "Gungan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tarpals_thumb.jpg",
    "vehicle": "Kaadu",
    "weapon": "Electropole, cesta, boomer",
    "name": "General Tarpals",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Gungan Grand Army, Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tarpals_detail.png",
    "biography": "The gravelly-voiced patrol chief of Otoh Gunga, Tarpals has endured many a headache caused by the antics of Jar Jar Binks. Tarpals kept an eye on the bumbling outcast, making sure the youngster didn't re-enter Gungan society. During the Trade Federation occupation of Naboo, Tarpals was part of the Gungan Grand Army that fought against the battle droid invaders. Ironically, Tarpals served under Binks, who had unexpectedly received the rank of general by Boss Nass himself. Tarpals stayed close to Binks, trying to keep his commanding officer out of trouble.\nBy the time of the Clone Wars, Tarpals was promoted to general, and served as leader of the Gungan Grand Army."
  },
  {
    "title": "Governor of the Outer Rim Territories",
    "height": "1.85 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tarkin_thumb.jpg",
    "vehicle": "",
    "weapon": "Death Star",
    "name": "Tarkin",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Galactic Republic, Galactic Empire",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tarkin_detail.png",
    "biography": "An ambitious, ruthless proponent of military power, Tarkin became a favorite of Supreme Chancellor Palpatine and rose rapidly through the Imperial ranks. Shortly after the Empire's creation, he was put in charge of the construction of the Death Star.\nTarkin saw the Death Star as a way to crush all dissent to the Empire's rule -- fear of the station's planet-killing superlaser would keep the galaxy's star systems in line. He demonstrated the station's power by destroying Alderaan, but died soon afterwards when the Death Star itself was destroyed."
  },
  {
    "title": "Mighty Wookiee Warrior",
    "height": "2.32 meters",
    "species": "Wookiee",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tarfful_thumb.jpg",
    "vehicle": "Wookiee flying catamaran",
    "weapon": "Bowcaster, blaster rifle",
    "name": "Tarfful",
    "gender": "Male",
    "homeworld": "Kashyyyk",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tarfful_detail.png",
    "biography": "A massive Wookiee general, Tarfful helped defend his native Kashyyyk during the Clone Wars. A distress signal brought Tarfful and his most trusted warriors rushing to Chewbacca's help against the hated Trandoshans on the hunting grounds of Wasskah. Later, Tarfful and Chewbacca fought side by side with General Yoda on the battlegrounds of Kashyyyk."
  },
  {
    "title": "Everyone's a Suspect",
    "height": "1.8 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tandivo_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster pistol",
    "name": "Tan Divo",
    "gender": "Male",
    "homeworld": "Coruscant",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/tandivo_detail.png",
    "biography": "As a police lieutenant in the Coruscant Security Force during the Clone Wars, Lieutenant Tan Divo has a low-rate of success in his investigations, yet displays the pompousness and self-importance of someone who always gets his criminal in the end. Because of his arrogance, he often jumps to conclusions of guilt before a thorough investigation is conducted. Pride and his rigid by-the-book agenda get in the way of finding the truth, which in turn forces others to seek clues without his help."
  },
  {
    "title": "Mandalorian Senator",
    "height": "1.85 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/talmerrik_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster pistol",
    "name": "Tal Merrik",
    "gender": "Male",
    "homeworld": "Kalevala",
    "affiliation": "Death Watch",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/talmerrik_detail.png",
    "biography": "A Senator from Duchess Satine's home planet of Kalevala, Tal Merrik is not the man he first appears to be. Conniving and greedy, Senator Merrik will happily betray his closest \"friend\" if it helps him achieve his shady political goals. Merrik is secretly sympathetic to the Death Watch, and betrays Duchess Satine when she is most vulnerable -- en route from Mandalore to Coruscant aboard her starship Coronet. The slippery Merrik tries to outwit the Duchess and her protector, Obi-Wan Kenobi, but ends up running afoul of Anakin Skywalker's lightsaber."
  },
  {
    "title": "AKA Miss Snooty",
    "height": "1.65 meters",
    "species": "Pa'lowick",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sysnootles_thumb.jpg",
    "vehicle": "",
    "weapon": "Hold-out blaster pistol",
    "name": "Sy Snootles",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Criminal",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sysnootles_detail.png",
    "biography": "Sy Snootles, a long-limbed Pa'lowick, was a popular singer and dancer whose patrons included Jabba the Hutt. Very few realized that she also worked as a spy for the Hutt criminal cartels, and that she betrayed her love, Ziro the Hutt, in exchange for a big payday."
  },
  {
    "title": "Have Gunship, Will Travel",
    "height": "1.82 meters",
    "species": "Zabrak",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sugi_thumb.jpg",
    "vehicle": "Halo",
    "weapon": "Sawed off blaster rifle",
    "name": "Sugi",
    "gender": "female",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sugi_detail.png",
    "biography": "The leader of a group of noble bounty hunters, this female Zabrak asks no quarter and gives no quarter. Tough and fair minded, she took jobs she believed in, contrary to what others may think. Among the more heroic tasks she has undertaken were protecting a defenseless farming village from pirates on Felucia, and saving stranded younglings from Trandoshan hunting grounds."
  },
  {
    "title": "Embodiment of Darkness",
    "height": "2.2 meters (apparent)",
    "species": "Force wielder",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/son_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Son",
    "gender": "Male",
    "homeworld": "Mortis",
    "affiliation": "Dark side",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/son_detail.png",
    "biography": "The Son was an embodiment of the dark side of the Force who dwelled on Mortis during the Clone Wars with his sister, the light-sider known as Daughter, and the powerful Force user known as Father, who tried to keep them in balance.\nSon sought to escape Mortis and wreak havoc in the galaxy, trying repeatedly to lure Anakin Skywalker to the dark side by changing form, possessing Ahsoka Tano and finally by showing Anakin a vision of the terrible acts he would commit. His efforts ultimately failed, culminating in his death along with those of Daughter and Father."
  },
  {
    "title": "The Outlands Butcher",
    "height": "1.84 meters",
    "species": "Sakiyan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sixtat_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster pistol",
    "name": "Sixtat",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sixtat_detail.png",
    "biography": "Sixtat's grim talent for slaying his targets in a gruesome manner earned him the colorful title of the Outlands Butcher. He was a Sakiyan, a species well-suited for hunting big game, thanks to their keen senses and quick reflexes. He translated such talents into bounty hunting, gaining him much notoriety as well as the arrogance to believe he was unstoppable."
  },
  {
    "title": "Governor of Naboo",
    "height": "1.79 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/siobibble_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Sio Bibble",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Naboo Royal Advisory Council",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/siobibble_detail.png",
    "biography": "Sio Bibble was the outspoken governor of Naboo. When the Trade Federation brazenly blockaded the trade routes to the small pastoral world, Bibble was among the first to suspect invasion. His suspicions proved correct. Bibble, like the rest of the Naboo citizenry, was taken captive by the mechanized armies of the Trade Federation.\nQueen Amidala fled to Coruscant with the help of Jedi ambassadors to secure aid from Senator Palpatine. Bibble stayed behind, to placate the Neimoidian invaders and to represent the besieged people. Nute Gunray delighted in toying with Bibble, taunting him about the dire state of the Naboo populace.\nAfter Naboo was liberated, Bibble attended the parade celebrating the newfound freedom."
  },
  {
    "title": "Master of Holographic Disguise Matrix",
    "height": "1.74 meters",
    "species": "Snivvian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sinrich_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster pistol and heavy blaster pistol",
    "name": "Sinrich",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sinrich_detail.png",
    "biography": "Though his snaggletoothed grin made him appear friendly, Sinrich was a master of deception. He invented the holographic disguise matrix, an advanced form of holographic projection that cloaked a user in a vivid projection recreating the visage of another person. It was more than just a mere mask -- the experimental holographic matrix compensated for the differences in sizes between disguise and disguised, allowing beings of distinct stature and build to convincingly pose as their physical opposites."
  },
  {
    "title": "Mother of the Chosen One",
    "height": "1.63 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/shmiskywalker_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Shmi Skywalker Lars",
    "gender": "Female",
    "homeworld": "Tatooine",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/shmiskywalker_detail.png",
    "biography": "The mother of Anakin Skywalker was also a brave and resilient woman who survived life as a slave to become a Tatooine moisture farmer. Shmi surrendered her son to the Jedi Order, putting him on a path to become one of the greatest Jedi. Her death at the hands of Tusken Raiders became a critical step on Anakin's journey to the dark side."
  },
  {
    "title": "Compassionate Jedi",
    "height": "1.87 meters",
    "species": "Togruta",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/shaakti_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Shaak Ti",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/shaakti_detail.png",
    "biography": "A wise and patient Jedi Master, the Togruta Shaak Ti fought at the Battle of Geonosis, and supervised the training of clone cadets on Kamino. There, she struggled to balance the necessity of producing capable troopers with compassion for the clones as living beings.\nTi helped defend Kamino against Separatist attack, balancing assignments in the field with her duties on the Jedi Council."
  },
  {
    "title": "Podracing Legend",
    "height": "1.12 meters",
    "species": "Dug",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sebulba_thumb.jpg",
    "vehicle": "Podracer",
    "weapon": "",
    "name": "Sebulba",
    "gender": "Male",
    "homeworld": "Malastare",
    "affiliation": "Boonta Eve Podracers",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sebulba_detail.png",
    "biography": "A crafty, vicious Dug, Sebulba became one of the Outer Rim's most successful Podracers. Whether roaming the streets of Mos Espa or piloting his massive orange Podracer, Sebulba was aggressive and arrogant. He was not above cheating to win a race, and would even resort to illegal weapons in an attempt to defeat his opponents. Sebulba was Mos Espa's reigning Podrace champion until he entered the Boonta Eve Classic, where he was defeated by young Anakin Skywalker, much to the Dug's frustration."
  },
  {
    "title": "Instrument of Vengeance",
    "height": "1.89 meters",
    "species": "Dathomorian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/savageopress_thumb.jpg",
    "vehicle": "",
    "weapon": "Enchanted vibro-ax; double-ended lightsaber",
    "name": "Savage Opress",
    "gender": "Male",
    "homeworld": "Dathomir",
    "affiliation": "Nightbrothers",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/savageopress_detail.png",
    "biography": "Savage Opress was once a common Nightbrother whose fighting prowess impressed Asajj Ventress. Transformed into a monstrous warrior by Mother Talzin, Opress became Count Dooku's new assassin and secret Sith apprentice. His loyalty, however, remained to Talzin. The Nightsisters leader gave Savage a new quest: to find his brother, Darth Maul, who had somehow survived his apparent death and was living in exile in the Outer Rim."
  },
  {
    "title": "Naboo Leviathan",
    "height": "About 200 meters long",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sandoaquamonster_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "sando aqua monster",
    "gender": "",
    "homeworld": "Naboo",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sandoaquamonster_detail.png",
    "biography": "A fearsome leviathan lurking the waters of Naboo, the sando aqua monster is aptly named for its prodigious size and monstrous appetite. Its huge mouth can swallow most other sea creatures -- or even a Gungan sub -- in a single gulp. Its heavily muscled body is almost feline in appearance, with sinewy limbs terminating in massively finned claws that propel the creature through the depths."
  },
  {
    "title": "The Decoy Queen",
    "height": "1.65 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sabe_thumb.jpg",
    "vehicle": "",
    "weapon": "Royal blaster pistol",
    "name": "Sabe",
    "gender": "Female",
    "homeworld": "Naboo",
    "affiliation": "Naboo Royal Handmaidens",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/sabe_detail.png",
    "biography": "Sabe is the most important of Queen Amidala's royal retinue of handmaidens. During crisis situations, Sabe and Amidala switch roles. Sabe becomes a decoy, disguised as the Queen, while Amidala adopts a simple gown of a handmaiden, and goes by her less formal name of Padme Naberrie. When in this role, Sabe and Padme secretly communicate with subtle signals as to not divulge their true identities. During the Trade Federation invasion of Naboo, Sabe posed as the Queen on several occasions."
  },
  {
    "title": "Lovestruck Separatist Senator",
    "height": "1.92 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rushclovis_thumb.jpg",
    "vehicle": "",
    "weapon": "Deactivator hold-out pistol",
    "name": "Rush Clovis",
    "gender": "Male",
    "homeworld": "Scipio",
    "affiliation": "InterGalactic Banking Clan, Galactic Senate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rushclovis_detail.png",
    "biography": "A Senator from Scipio, Rush worked closely with Senator Padme Amidala early in her career. The two were romantically linked, until she insisted they return their relationship to a strictly professional level. With regret, Clovis respected her wishes. He continued to serve his people in the Senate, and became an influential representative of the InterGalactic Banking Clan. When the Clone Wars erupted, many in the Senate and Jedi Order suspected Rush's loyalty to the Republic. It was believed that the Banking Clan was secretly funding the Separatists."
  },
  {
    "title": "Trade Federation Official",
    "height": "1.96 meters",
    "species": "Neimoidian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/runehaako_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Rune Haako",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Trade Federation, Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/runehaako_detail.png",
    "biography": "A cowardly Neimoidian official, Rune Haako had no shortage of despair during the Trade Federation blockade and invasion of Naboo. As lieutenant to Viceroy Nute Gunray, Haako was privy to his superior's plans and knew of the mysterious Sith patron who was the true mastermind behind their bold maneuvers. Haako, when beyond Sith earshot, openly questioned Gunray's judgment in striking this terrifying alliance. The worry-faced pessimist predicted disaster throughout the occupation. When Queen Amidala retook her besieged capital of Theed, Haako and Gunray were captured and sent to Coruscant for trial and punishment."
  },
  {
    "title": "Senator of Pantora",
    "height": "1.65 meters",
    "species": "Pantoran",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/riyochuchi_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Riyo Chuchi",
    "gender": "Female",
    "homeworld": "Pantora",
    "affiliation": "Galactic Senate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/riyochuchi_detail.png",
    "biography": "Young and idealistic Riyo Chuchi represented Pantora in the Galactic Senate. She began her term in the Senate timidly, often submitting to her hawkish local chairman, Chi Cho. When Cho eventually crossed a line that brought war to the world of Orto Plutonia, Chuchi bravely stood up to him and ended the conflict. As time passed Chuchi grew into a far stronger leader and was able to force the Trade Federation into lifting a blockade over her home planet."
  },
  {
    "title": "Influential Gungan Minister",
    "height": "2.07 meters",
    "species": "Gungan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rishloo_thumb.jpg",
    "vehicle": "Speeder bike, Gungan bongo",
    "weapon": "Ceremonial dagger",
    "name": "Rish Loo",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Gungan Rep Council",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rishloo_detail.png",
    "biography": "The Gungans are a reverent people with a pantheon of gods looking over their lives. Priests can be extremely influential in Gungan society, though some have used such authority for their own gain. Minister Rish Loo is said to have many connections to ancient mystical powers, but where his true motives lie remain uncertain."
  },
  {
    "title": "Separatist Tyrant",
    "height": "2.21 meters",
    "species": "Karkarodon",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rifftamson_thumb.jpg",
    "vehicle": "",
    "weapon": "Powerful jaws",
    "name": "Riff Tamson",
    "gender": "Male",
    "homeworld": "Karkaris",
    "affiliation": "Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rifftamson_detail.png",
    "biography": "A ravenous Karkarodon, Riff Tamson was a ruthless Separatist commander placed in charge of operations on the water world of Mon Cala. Count Dooku tasked him to disrupt the fragile peace between the Mon Calamari and the Quarren. Though present on the planet as a Separatist envoy, he secretly conspired with Quarren chieftain Nossor Ri to bring the Quarren into the war on the side of the Confederacy. Though Nossor believed he was doing what was best for his people, he had no idea of the true extent of Tamson's wicked plans."
  },
  {
    "title": "Royal Starship Pilot",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ricolie_thumb.jpg",
    "vehicle": "Naboo N-1 starfighter, Naboo Royal Starship",
    "weapon": "Blaster pistol",
    "name": "Ric Olie",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Naboo Space Fighter Corps",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ricolie_detail.png",
    "biography": "A veteran of the Naboo Space Fighter Corps, Ric Olie was the leader of Bravo Flight and had the honor of flying Queen Amidala's Royal Starship to and from Naboo. Answerable directly to Captain Panaka, Olie was capable of flying any craft on Naboo.\nDuring the Battle of Naboo, Olie's squadron of N-1 starfighters were successful in destroying the Trade Federation's Droid Control Ship with the help of Anakin Skywalker."
  },
  {
    "title": "Captain of the 501st",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rex_thumb.jpg",
    "vehicle": "Jetpack, AT-TE walker, BARC speeder",
    "weapon": "Blaster pistols, blaster rifle",
    "name": "Clone Captain Rex",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rex_detail.png",
    "biography": "Clone Captain Rex served the Republic during the Clone Wars, often taking orders from Anakin Skywalker and Ahsoka Tano. He viewed military service as an honor, and he always completed his mission. Fond of using two blaster pistols at the same time, Rex customized his armor with distinctive blue markings."
  },
  {
    "title": "Scrappy Little Racer",
    "height": ".79 meters",
    "species": "Aleena",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rattstyerell/rattstyerell_thumb.jpg",
    "vehicle": "Podracer",
    "weapon": "",
    "name": "Ratts Tyerell",
    "gender": "Male",
    "homeworld": "Aleen",
    "affiliation": "Boonta Eve Podracers",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rattstyerell/rattstyerell_detail.png",
    "biography": "Ratts Tyerell was the tiniest of the Podracer pilots in the Boonta Eve Classic, though size matters not in such a competition. The little scrapper piloted a Podracer with immense engines ... too big, it would seem, for the tight confines of the Laguna Caves. On the second lap of the race, Ratts' accelerator jammed, and he couldn't get clearance past the rocky stalactites. The resulting fireball killed the little guy. His family, who had traveled to Mos Espa to witness the race, was reportedly seen grieving shortly thereafter."
  },
  {
    "title": "Marksman of Concord Dawn",
    "height": "1.89 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rakohardeen_thumb.jpg",
    "vehicle": "Speeder bike",
    "weapon": "Blaster sniper rifle, blaster pistol, smoke grenades",
    "name": "Rako Hardeen",
    "gender": "Male",
    "homeworld": "Concord Dawn",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/rakohardeen_detail.png",
    "biography": "Rako Hardeen had aspirations for greatness -- he wanted to stand shoulder-to-shoulder among the legendary bounty hunters of his era, hired guns like Cad Bane, Embo and Twazzi. A crack shot, he was reputed to be the best marksman from Concord Dawn, but he never gained the notoriety he desired. That is, until the day he killed Obi-Wan Kenobi...\nHardeen was hired by a mysterious client to target Kenobi. He succeeded, just barely outrunning Kenobi's vengeful former apprentice, Anakin Skywalker. Hiding out in the seamy depths of Coruscant, Rako was shocked to discover his client was the Jedi Council. it was part of a secret plot to replace Hardeen with a Jedi agent to infiltrate the criminal underworld."
  },
  {
    "title": "Plucky Droid",
    "height": ".96 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/r2d2_thumb.jpg",
    "vehicle": "Jedi starfighter, X-wing fighter",
    "weapon": "Electro-shock prod",
    "name": "R2-D2",
    "gender": "",
    "homeworld": "Naboo",
    "affiliation": "Galactic Republic, Rebel Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/r2d2_detail.png",
    "biography": "A resourceful astromech droid, R2-D2 served Padme Amidala, Anakin Skywalker and Luke Skywalker in turn, showing great bravery in rescuing his masters and their friends from many perils. A skilled starship mechanic and fighter pilot's assistant, he formed an unlikely but enduring friendship with the fussy protocol droid C-3PO.\nR2-D2's mechanical body contains numerous arms tipped with all manner of useful tools, from welding torches to computer interfaces. Like other astromechs, his language is a cacophony of beeps and whistles understandable only by some other droids. But the spunky little droid's abundant personality generally makes his meaning plain enough."
  },
  {
    "title": "Rogue Jedi",
    "height": "1.91 meters",
    "species": "Human/Kiffar",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/quinlanvos_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Quinlan Vos",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/quinlanvos_detail.png",
    "biography": "A Jedi with a sarcastic sense of humor and a reputation for not playing by the rules, Quinlan Vos was an expert tracker renowned for his ability to read memories from objects people handled."
  },
  {
    "title": "Venerable Jedi Master",
    "height": "1.93 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/quigonjin_thumb.jpg",
    "vehicle": "eopie",
    "weapon": "Lightsaber",
    "name": "Qui-Gon Jinn",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/quigonjinn_detail.png",
    "biography": "A venerable if maverick Jedi Master, Qui-Gon Jinn was a student of the living Force. Unlike other Jedi Masters, who often lose themselves in the meditation of the unifying Force, Qui-Gon Jinn lived for the moment, espousing a philosophy of \"feel, don't think -- use your instincts.\" Were it not for Qui-Gon's unruly views, he would have undoubtedly been on the Jedi Council.\nOn Tatooine, Qui-Gon discovered a young slave boy named Anakin Skywalker who was strong in the Force. Sensing the boy's potential, Qui-Gon liberated Anakin from slavery. The Jedi Master presented Anakin to the Jedi Council, but the council felt Anakin's future seemed clouded and uncertain. They deemed the boy too old to begin training and dangerously full of fear and anger. They refused to allow Qui-Gon to train Anakin, but rescinded their decision to fulfill Qui-Gon's dying wish."
  },
  {
    "title": "Queen of Zygerria",
    "height": "1.85 meters",
    "species": "Zygerrian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/queenmirajscintel_thumb.jpg",
    "vehicle": "brezak",
    "weapon": "electro-whip",
    "name": "Queen Miraj Scintel",
    "gender": "Female",
    "homeworld": "Zygerria",
    "affiliation": "Zygerrian Slave Empire, Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/queenmirajscintel_detail.png",
    "biography": "The Queen of Zygerria, Miraj Scintel longs for a return to glory for her people. Ages ago, the Zygerrian Slave Empire stretched across many sectors, supplying luckless labor to unscrupulous masters in the galaxy. Scintel takes advantage of a Republic distracted by war to grow the slave trade, allied by the Separatist Alliance. When Anakin Skywalker goes undercover to infiltrate Scintel's court, and discover the whereabouts of a vanished colony of Togruta artisans, the wily Queen takes interest in him. She sees in Anakin a prize to own and overpower, and uses her seductive charms to her full advantage."
  },
  {
    "title": "Secret Geonosian Queen",
    "height": "8.6 meters long",
    "species": "Geonosian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/queenkarina_thumb.jpg",
    "vehicle": "",
    "weapon": "Brain worms",
    "name": "Queen Karina the Great",
    "gender": "Female",
    "homeworld": "Geonosis",
    "affiliation": "Geonosian Hive",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/queenkarina_detail.png",
    "biography": "The secret leader of the Geonosians, Karina dwelled in the catacombs beneath the Progate Temple, laying eggs, controlling an army of Geonosian drones, and giving orders to public Geonosian leaders such as Poggle the Lesser.\nWhen Poggle fled to the Temple, the Jedi followed and discovered Karina, who had captured Luminara Unduli -- and now sought control of Jedi Knights."
  },
  {
    "title": "Heroic Rebel Leader",
    "height": "1.5 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/princessleia_thumb.jpg",
    "vehicle": "Alderaanian cruiser",
    "weapon": "Blaster pistol",
    "name": "Princess Leia Organa",
    "gender": "Female",
    "homeworld": "Alderaan (born on Polis Massa)",
    "affiliation": "Rebel Alliance, Galactic Senate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/princessleia_detail.png",
    "biography": "Separated from a mother she barely knew and a father she later counted among her worst enemies, Leia Organa is a princess who grew up enmeshed in the politics of her time. She accomplished much by a young age: a leader in the Rebel Alliance, a former member of the Imperial Senate, and a member of the Royal Family of Alderaan. She never desired the power that was thrust upon her, but so strong was her commitment to peace, freedom, and democracy that she was willing to accept the burdens and the risks that it took to accomplish her goals."
  },
  {
    "title": "Leader of a Divided World",
    "height": "1.7 meters",
    "species": "Mon Calamari",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/princeleechar_thumb.jpg",
    "vehicle": "",
    "weapon": "Mon Calamari spear blaster ",
    "name": "Prince Lee-Char",
    "gender": "Male",
    "homeworld": "Mon Cala",
    "affiliation": "Mon Cala, allied to the Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/princeleechar_detail.png",
    "biography": "The heir to the throne of Mon Calamari during the Clone Wars, Prince Lee-Char carried the burdens of his home world on his small shoulders following the assassination of his father, King Yos Kolina. Separatist agitators began stirring up the undercurrents of hostility between the Mon Calamari and the Quarren, pushing the planet towards civil war.\nDespite his inexperience, Lee-Char longed to unite his people, but could not find the way. Surrounded by wise advisors -- like Captain Ackbar, Senator Meena Tills, and representatives from the Jedi Order and the Galactic Senate -- Lee-Char concentrated on survival as war erupted in the oceans of Mon Cala. But he did not give up hope in unifying the planet in resisting the Separatists."
  },
  {
    "title": "Nomadic Warrior",
    "height": "1.84 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/previzsla_thumb.jpg",
    "vehicle": "Rocket pack",
    "weapon": "Blaster pistol, darksaber",
    "name": "Pre Vizsla",
    "gender": "Male",
    "homeworld": "Mandalore",
    "affiliation": "Death Watch",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/previzsla_detail.png",
    "biography": "Pre Vizsla publicly served Duchess Satine as the governor of Mandalore's moon Concordia, but was really the leader of the Death Watch, a secret society of Mandalorian commandos who sought to overthrow Satine's government and reclaim the Mandalorians' honor as warriors.\nVizsla and Count Dooku plotted to assassinate Satine, which would lead to a Republic occupation of Mandalore. Vizsla's Death Watch would then liberate the planet, joining the Separatist cause.\nThings did not go according to plan, and Vizsla and Dooku bitterly parted ways. Death Watch became a group of nomadic warriors, with the formerly manicured and orderly Vizsla becoming unkempt and battle-worn as their leader."
  },
  {
    "title": "Archduke of Geonosis",
    "height": "1.75 meters",
    "species": "Geonosian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/pogglethelesser_thumb.jpg",
    "vehicle": "",
    "weapon": "Geonosian sonic blaster",
    "name": "Poggle the Lesser",
    "gender": "Male",
    "homeworld": "Geonosis",
    "affiliation": "Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/pogglethelesser_detail.png",
    "biography": "Poggle the Lesser was the leader of the insect-like Geonosians throughout the era of the Clone Wars. Due to his control of the Geonosian battle droid factories, he was a powerful figure within the Confederacy of Independent Systems and commanded the droid armies that fought against the Republic in two battles for control of Geonosis. At the end of the war, Poggle lost his life to Darth Vader."
  },
  {
    "title": "The Blade of Dorin",
    "height": "1.88 meters",
    "species": "Kel Dor",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/plokoon_thumb.jpg",
    "vehicle": "Jedi starfighter",
    "weapon": "Lightsaber",
    "name": "Plo Koon",
    "gender": "Male",
    "homeworld": "Dorin",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/plokoon_detail.png",
    "biography": "Level-headed and unflappably calm, Jedi Master Plo Koon is among the wisest in the Jedi Order. Deeply concerned for life of every form, Plo Koon is especially devoted to protecting the clones under his command. Master Plo shares a special bond with Ahsoka Tano for finding her as a baby."
  },
  {
    "title": "Chairman of Pantora",
    "height": "1.77 meters",
    "species": "Pantoran",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/papanoida_thumb.jpg",
    "vehicle": "Pantoran cruiser",
    "weapon": "Twin blaster pistols, swagger stick",
    "name": "Chairman Papanoida",
    "gender": "Male",
    "homeworld": "Pantora",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/papanoida_detail.png",
    "biography": "Papanoida became chairman of Pantora after the death of Chi Cho. When he refused to join the Separatists, they blockaded Pantora and hired the bounty hunter Greedo to kidnap Papanoida's daughters.\nUnwilling to wait for Coruscant law enforcement or the Senate to help, Papanoida took it on himself to solve the kidnapping and rescue his children."
  },
  {
    "title": "The Last Chancellor",
    "height": "1.73 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/palpatine_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Palpatine",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Galactic Republic, Galactic Senate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/palpatine_detail.png",
    "biography": "Palpatine was the last chancellor of the Old Republic, and the mastermind behind the biggest power-grab in galactic history. Practicing forbidden Sith techniques under his alternate identity of Darth Sidious, Palpatine arranged for his public persona to deflect suspicion while receiving praise and political respect. In time he moved from a senator representing Naboo to the Republic's Supreme Chancellor, and used the power of his office to launch the Clone Wars. With Order 66 bringing about the end of the Jedi Order, Palpatine declared himself Emperor. This marked an end to his \"kindly old man\" charade with which he had fooled even the wisest members of the Jedi Council."
  },
  {
    "title": "Senator from Naboo",
    "height": "1.65 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/padmeamidala_thumb.jpg",
    "vehicle": "Royal Naboo starship, Royal Naboo cruiser, Naboo yacht, Naboo starfighter",
    "weapon": "Royal blaster pistol",
    "name": "Padme Amidala",
    "gender": "Female",
    "homeworld": "Naboo",
    "affiliation": "Galactic Republic, Galactic Senate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/padmeamidala_detail.png",
    "biography": "An idealist during a time of corruption and war in the Republic, Padme Amidala was determined to fix what wrongs she could in the Senate, where she represented her idyllic home planet of Naboo. Despite her busy career, Padme found time for a secret, forbidden marriage with Anakin Skywalker, the Jedi hero of the Clone Wars. Though not a soldier, Padme nonetheless found herself often in the thick of danger as she courageously defended her deepest held beliefs."
  },
  {
    "title": "Rodian Pawnbroker",
    "height": "",
    "species": "Rodian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/pablo_thumb.jpg",
    "vehicle": "",
    "weapon": "Anything you want. Just make him an offer.",
    "name": "Pablo",
    "gender": "Male",
    "homeworld": "Nal Hutta",
    "affiliation": "Criminal",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/pablo_detail.png",
    "biography": "On a lawless world like Nal Hutta, every corner store might be the source of lethal munitions and untraceable weaponry. Pablo's pawnshop proudly boasted all sorts of deadly gear. Based out of the Bilbousa Bazaar, Pablo kept a well-stocked shop reputed to have everything a bounty hunter might need. The shifty Rodian spoke in a sycophantic whisper, always careful not to upset his potentially murderous clientele. His connection to the Hutts and his ability to keep his store well-stocked is what kept the slimy trader alive and intact. If threatened, the spineless Rodian always backed down, much to the consternation of his Twi'lek partner, who worried for his safety."
  },
  {
    "title": "Warden of the Citadel",
    "height": "2.03 meters",
    "species": "Phindian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/osisobeck_thumb.jpg",
    "vehicle": "STAP",
    "weapon": "Blaster rifle",
    "name": "Osi Sobeck ",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/osisobeck_detail.png",
    "biography": "Fiery-tempered and cruel, Osi Sobeck was born to be the warden of so hope-draining an installation as the Citadel, an infamous prison designed to hold rogue Jedi. Commanded by the Separatists, Sobeck did what he could to please his new master, Count Dooku."
  },
  {
    "title": "Subterranean Trickster",
    "height": "1.75 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/orphne/orphne_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Orphne",
    "gender": "Female",
    "homeworld": "Aleen",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/orphne/orphne_detail.png",
    "biography": "Dwelling deep beneath the surface of Aleen is a strange being known as Orphne. Of reptilian descent with a quick tongue and a clever wit, Orphne knows of the delicate balance that must be maintained between the surface and subsurface worlds. The nymph was witness to the upsetting of this balance when a passage between both worlds was inadvertently breached, which resulted in tumultuous ground quakes shaking the planet."
  },
  {
    "title": "Indulgent Politician",
    "height": "1.84 meters",
    "species": "Twi'lek",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ornfreetaa_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Orn Free Taa",
    "gender": "Male",
    "homeworld": "Ryloth",
    "affiliation": "Galactic Republic, Galactic Senate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ornfreetaa_detail.png",
    "biography": "A corpulent, corrupt Twi'lek Senator from Ryloth, Orn Free Taa was disliked on his homeworld for enriching himself on Coruscant and enmeshing himself in politics, becoming a leading power broker in the Senate.\nFree Taa was one of the Republic's leading Loyalists and a strong backer of the military, but his indulgences made him a symbol of everything the Separatists considered rotten about the Republic."
  },
  {
    "title": "Ithorian Bounty Hunter",
    "height": "2.05 meters",
    "species": "Ithorian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/onca_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster rifles",
    "name": "Onca",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/onca_detail.png",
    "biography": "Together with his brother Bulduga, Onca was part of a legendary bounty hunting team. While Bulduga fancied himself a fast-drawing gunslinger, Onca was slower, unable to overcome the bulk of his Ithorian build to snap off shots as quickly as his brother could. Instead, Onca favored firepower over flash or finesse. He often carried more than one blaster rifle at a time, including a sawed-off one."
  },
  {
    "title": "Uncle Ono",
    "height": "1.75 meters",
    "species": "Rodian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/onacondafarr_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Onaconda Farr",
    "gender": "Male",
    "homeworld": "Rodia",
    "affiliation": "Galactic Republic, Galactic Senate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/onacondafarr_detail.png",
    "biography": "The Senator from Rodia, Onaconda Farr has long been a friend and ally to Padme Amidala. Farr disappointed many when he briefly allied his world to the Separatist cause, but he saw the error of his ways and returned to the Republic fold with Amidala's help. Nonetheless, the damage was done, and some in the Senate were not willing to forgive and forget."
  },
  {
    "title": "Youngling Castaway",
    "height": "1.74 meters",
    "species": "Cerean",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/omer_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "O-Mer",
    "gender": "Male",
    "homeworld": "Cerea",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/omer_detail.png",
    "biography": "A Cerean youngling who became a fugitive on the Trandoshan hunters' moon of Wasskah, O-Mer resigned himself to life on the run -- until Ahsoka Tano rallied him and his fellow Jedi to fight back against the cruel hunters.\nUsing his Jedi skills for something other than hiding and fleeing, O-Mer proved instrumental in the attack on the Trandoshan base, and won his way back to freedom."
  },
  {
    "title": "Podracing Speed Demon",
    "height": "1.63 meters",
    "species": "Er'Kit",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/odymandrell_thumb.jpg",
    "vehicle": "Podracer",
    "weapon": "",
    "name": "Ody Mandrell",
    "gender": "Male",
    "homeworld": "Tatooine",
    "affiliation": "Boonta Eve Podracers",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/odymandrell_detail.png",
    "biography": "A Tatooine native, Ody Mandrell was a foolhardy thrill-seeker who entered the fateful Boonta Eve Classic that saw the liberation of Anakin Skywalker. During a pit stop in the heat of the race, Mandrell suffered career-shattering misfortune. One of his record-setting pit droids was sucked into his massive engine intakes, crippling his Podracer."
  },
  {
    "title": "Legendary Jedi Knight",
    "height": "1.82 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/obiwankenobi_thumb.jpg",
    "vehicle": "Jedi starfighter",
    "weapon": "Lightsaber",
    "name": "Obi-Wan Kenobi",
    "gender": "Male",
    "homeworld": "Stewjon",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/obiwankenobi_detail.png",
    "biography": "Also known as the \"Negotiator,\" Obi-Wan Kenobi kept a cool head in the thick of combat. Obi-Wan was never at a loss for a quick word of wisdom or humor. He served as a General in the Repulic's army, with Clone Commander Cody often at his side.\nFor over a decade Obi-Wan guided young Anakin Skywalker on the path to Jedi Knighthood. Having to rein in an adventure-seeking youth made Obi-Wan wise -- and cynical -- beyond his years. True to his role, Obi-Wan recognized both Anakin's strengths and weaknesses, and he tried to impart his lessons with the patience and understanding that his mentor, Qui-Gon, did.\nFollowing the tragedy of the Clone Wars, and the rise of the Galactic Empire, Obi-Wan was one of the few Jedi survivors. He hid on Tatooine, living in exile while keeping a watchful eye over Luke Skywalker, Anakin's son who was also strong in the Force."
  },
  {
    "title": "Science Gone Mad",
    "height": "2.07 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/nuvovindi_thumb.jpg",
    "vehicle": "",
    "weapon": "Blue Shadow Virus",
    "name": "Doctor Nuvo Vindi",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/nuvovindi_detail.png",
    "biography": "Dr. Nuvo Vindi, a brilliant but demented Separatist scientist, tried to release the deadly Blue Shadow Virus during the Clone Wars. Working from a secret lab on Naboo, Dr. Vindi plotted a catastrophic outbreak that was foiled when the Republic found a cure before his virus could spread."
  },
  {
    "title": "Trade Federation Viceroy",
    "height": "1.91 meters",
    "species": "Neimoidian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/nutegunray_thumb.jpg",
    "vehicle": "Trade Federation battleship, Neimoidian shuttle, mechno-chair",
    "weapon": "Battle droids",
    "name": "Nute Gunray",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Trade Federation, Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/nutegunray_detail.png",
    "biography": "Neimoidians are known for their business skills, but Nute Gunray, Viceroy of the Trade Federation, was more cutthroat than most. It was Gunray who conspired with the Sith Lord Darth Sidious to launch the blockade and subsequent invasion of Naboo. Once the planet was under siege, Gunray attempted to force Queen Amidala to sign a treaty that would legitimize the occupation. Amidala escaped, and returned to infiltrate her own palace and blast through Gunray's protectors. At gunpoint, Amidala declared Gunray's occupation over.\nArrested by Republic officials, Gunray was carted off to answer for his crimes. But even justice could be bought in the final corrupt years of the Republic. After four trials in the Supreme Court, Gunray still held his position of Viceroy. He secretly pledged his support to the Separatist Alliance, though the Trade Federation \"officially\" distanced themselves from Gunray's treasonous activities, declaring him to be a rogue extremist."
  },
  {
    "title": "Twi'lek Survivor",
    "height": "1 meter",
    "species": "Twi'lek",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/numa_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Numa",
    "gender": "Female",
    "homeworld": "Ryloth",
    "affiliation": "Neutral, but friend to Waxer and Boil",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/numa_detail.png",
    "biography": "A Twi'lek child who lived on the planet Ryloth during the Clone Wars, Numa escaped being captured by the Separatist droid army by hiding in tunnels beneath the town of Nabat.\nTwo clone troopers from Ghost Company -- Boil and Waxer -- discovered Numa while on a recon mission. She showed them the tunnels, which Obi-Wan Kenobi then used to free the Twi'lek prisoners and defeat the town's Separatist occupiers."
  },
  {
    "title": "Chieftain of the Quarren",
    "height": "1.92 meters",
    "species": "Quarren",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/nossorri_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Nossor Ri",
    "gender": "Male",
    "homeworld": "Mon Cala",
    "affiliation": "Backed by the Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/nossorri_detail.png",
    "biography": "The chieftain of the Quarren people on Mon Cala, Nossor Ri was a friend to Mon Calamari King Yos Kolina, despite their clashing viewpoints. He was saddened by the shocking murder of the king, but could not support the rise of Prince Lee-Char, heir to the throne. Nossor believed Lee-Char was too young and inexperienced to lead the planet. Goaded by a Separatist \"adviser,\" Riff Tamson, Nossor Ri called for new leadership, and a chance for a Quarren to hold the throne. The Quarren chieftain would come to regret siding with Tamson and the Separatists."
  },
  {
    "title": "Millennium Falcon Co-Pilot",
    "height": "1.6 meters",
    "species": "Sullustan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/niennunb_thumb.jpg",
    "vehicle": "Millennium Falcon",
    "weapon": "",
    "name": "Nien Nunb",
    "gender": "Male",
    "homeworld": "Sullust",
    "affiliation": "Rebel Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/niennunb_detail.jpg",
    "biography": "Nien Nunb is a small, jowled, mouse-eyed native of Sullust, the world that served as the staging area for the Alliance Fleet prior to the Battle of Endor. Nunb was co-pilot to Lando Calrissian aboard the Millennium Falcon during that historic event. Many of his fellow Sullustans also served as Alliance starfighter pilots in the battle. Nunb spoke the liquid, chattering tongue of the Sullustans, a language Lando understood."
  },
  {
    "title": "Leader of the Nightsisters",
    "height": "2.23 meters",
    "species": "Dathomirian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/mothertalzin_thumb.jpg",
    "vehicle": "",
    "weapon": "Nightsister magicks",
    "name": "Mother Talzin",
    "gender": "Female",
    "homeworld": "Dathomir",
    "affiliation": "Nightsisters",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/mothertalzin_detail.png",
    "biography": "Mother Talzin, the spiritual guide of Dathomir's Nightsisters during the Clone Wars, holds enormous power on her homeworld and wields the strange magics of the dark side. She sells the services of the Nightsisters to the galaxy's wealthy and powerful, but isn't above backstabbing any clients who treat her clan with disrespect."
  },
  {
    "title": "Criminal Mastermind",
    "height": "1.75 meters",
    "species": "Phindian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/moraloeval_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster pistol",
    "name": "Moralo Eval",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Criminal",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/moraloeval_detail.png",
    "biography": "Conniving even for Phindian standards, Moralo Eval earned a loathsome reputation as a heartless murderer at a young age. As a boy, he killed his mother, telling authorities he did it because he was \"bored.\" A lifetime spent as a criminal and a fugitive gave Eval a sharp survival instinct, and he had impressive technical and engineering skills. Life on the run may have also left him deranged; Moralo's odd mannerisms included talking about himself in the third person. During the Clone Wars, reports surfaced that Moralo was working with Count Dooku, possibly plotting to kidnap Chancellor Palpatine, even though Eval was behind bars at the time."
  },
  {
    "title": "Separatist Voice of Reason",
    "height": "1.78 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/minabonteri_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Mina Bonteri ",
    "gender": "Female",
    "homeworld": "Onderon",
    "affiliation": "Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/minabonteri_detail.png",
    "biography": "A Senator of the Confederacy of Independent Systems, Mina Bonteri had been a friend to Padme Amidala, serving as her mentor on Naboo. Padme missed her friend dearly, but contact between the Separatist and Republic governments was illegal during the Clone Wars. Nonetheless, Padme secretly voyaged to Raxus, where she developed a peace accord with Mina. Bonteri proposed the peace overture to the Separatist government, finding support. The corporate barons secretly profiting the war did not agree, however. Mina died under mysterious circumstances, supposedly killed by the Republic, and her peace effort died as well. She was survived by her son, Lux Bonteri."
  },
  {
    "title": "Senator of the Mon Calamari",
    "height": "1.71 meters",
    "species": "Mon Calamari",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/meenatills_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Meena Tills",
    "gender": "Female",
    "homeworld": "Mon Cala",
    "affiliation": "Galactic Senate, Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/meenatills_detail.png",
    "biography": "The watery world of Mon Cala was the site of a civil war during the Clone Wars, as the Mon Calamari people sided with the Republic, while the Quarren were backed by the Separatist Alliance. Senator Meena Tills was caught in the midst of this conflict, advising where she could while under the protection of the Jedi and clone troopers.\nLater, Senator Tills was part of the Delegation of 2,000 -- Senatorial representatives concerned with the manner in which Chancellor Palpatine had waged the Clone Wars. The Petition of 2,000 identified Senators formally complaining on Palpatine's conduct, and requested that he return his emergency powers to the Senate following the resolution of the conflict."
  },
  {
    "title": "Surprisingly Deadly Selkath",
    "height": "1.54 meters tall",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/mantu_thumb.jpg",
    "vehicle": "",
    "weapon": "Hold-out blaster",
    "name": "Mantu",
    "gender": "Male",
    "homeworld": "Manaan",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/mantu_detail.png",
    "biography": "A squat, hunched being with cold, clammy skin and a murderous twinkle in his eye, Mantu was far from a typical Selkath. Historically, his people had been regarded as a peaceful, helpful culture devoted to the tending of the ill, or the care of their oceans. How far had the Selkath fallen that Mantu was one of their most well known modern legends, a deadly bounty hunter who relied on surprise to target his prey."
  },
  {
    "title": "Powerful Jedi Master",
    "height": "1.92 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/macewindu_thumb.jpg",
    "vehicle": "Jedi starfighter",
    "weapon": "Lightsaber",
    "name": "Mace Windu",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/macewindu_detail.png",
    "biography": "A grim Jedi Master with an amethyst-bladed lightsaber, Mace Windu was the champion of the Jedi Order, with little tolerance for the failings of the Senate, the arguments of politicians or the opinions of rebellious Jedi.\nAs the Clone Wars intensified, Mace sensed the dark side of the Force at work, and knew the Jedi's enemies were plotting to destroy the Order and end its stewardship of the galaxy."
  },
  {
    "title": "Orphan of the Clone Wars",
    "height": "1.78 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/luxbonteri_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Lux Bonteri ",
    "gender": "Male",
    "homeworld": "Onderon",
    "affiliation": "Formerly Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/luxbonteri_detail.png",
    "biography": "The son of Separatist Senator Mina Bonteri, Lux was young, idealistic, and skeptical of the aims of the Republic and the Jedi Knights. His father was a fervent supporter of the Separatists, and was killed by clone troopers on Aargonar. Lux did not know what to make of Ahsoka Tano and her visit to Separatist space. After a failed peace overture begun by Mina and extended to the Republic, Lux's mother died under mysterious circumstances attributed to the Republic.\nLux didn't believe it, and determined that Count Dooku was behind his mother's murder in a heartless bid to continue the war. Lux swore vengeance against Dooku, and was willing to partner with Death Watch terrorists to have it."
  },
  {
    "title": "Jedi Master",
    "height": "1.76 meters",
    "species": "Mirialan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/luminaraunduli_thumb.jpg",
    "vehicle": "Republic attack cruiser",
    "weapon": "Lightsaber",
    "name": "Luminara Unduli",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/luminaraunduli_detail.png",
    "biography": "Luminara Unduli served the Jedi order in the final years of the Galactic Republic. A green-skinned female humanoid, Luminara was a trusted advisor to the Jedi Council and the Republic government. When crises demanded it, she and her faithful Padawan learner, Barriss Offee, would rush into the thick of conflict, where their incredible talents with the lightsaber blade served them well. Luminara is a model Jedi Knight -- she has mastered control of her emotions and her physical abilities."
  },
  {
    "title": "Last of the Jedi",
    "height": "1.72 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/lukeskywalker_thumb.jpg",
    "vehicle": "T-16 skyhopper, snowspeeder, X-wing fighter",
    "weapon": "Blaster pistol, lightsaber",
    "name": "Luke Skywalker",
    "gender": "Male",
    "homeworld": "Tatooine born on Polis Massa",
    "affiliation": "Rebel Alliance, Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/lukeskywalker_detail.png",
    "biography": "Raised as a farmboy on the backwater desert world of Tatooine, Luke had no idea that he was the secret son of Anakin Skywalker, the Chosen One born to bring balance to the Force. After his stepparents were murdered by the Empire, he destroyed the Death Star and became the Rebellion's greatest hero.\nBut Luke's true destiny lay with the Jedi Order. He learned the ways of the Force from Obi-Wan Kenobi and Yoda, and discovered the terrible secret of his parentage. Luke insisted there was still good in Darth Vader, and his love for his father reawakened Anakin's spirit, inspiring him to sacrifice himself to destroy Darth Sidious."
  },
  {
    "title": "Trade Federation Senator",
    "height": "1.9 meters",
    "species": "Neimoidian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/lottdodd_thumb.jpg",
    "vehicle": "",
    "weapon": "Poison",
    "name": "Lott Dod",
    "gender": "Male",
    "homeworld": "Cato Neimoidia",
    "affiliation": "Trade Federation, Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/lottdodd_detail.png",
    "biography": "To hear Lott Dod tell it, the actions of Nute Gunray did not reflect the true intents of the Trade Federation, which remained loyal to the Galactic Republic. Sure, the Separatist Alliance did use Trade Federation starships and battle droids as part of their fighting forces in the Clone Wars, but this was equipment legitimately purchased in the open market. The Trade Federation was committed to commerce across the entire galaxy, and had no interest in getting caught up in territorial wars, Dodd would say. In truth, the Senator received a healthy income to ensure both sides of the war stay well equipped."
  },
  {
    "title": "Separatist Inventor",
    "height": "2.11 meters",
    "species": "Neimoidian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/lokdurd_thumb.jpg",
    "vehicle": "Modified AAT tank",
    "weapon": "Defoliator cannon",
    "name": "Lok Durd",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/lokdurd_detail.png",
    "biography": "Lok Durd was an obese Neimoidian general in the army of the Confederacy of Independent Systems. A flamboyant and heartless weapons developer, some say if Lok Durd could make half the noise on the battlefield that he does in the war room, then the Separatists would have won the war. Durd longed to impress Count Dooku with his battlefield inventions. The Neimoidian general unleashed the Defoliator on the planet Maridun during the Clone Wars."
  },
  {
    "title": "Dashing Rogue",
    "height": "1.78 meters",
    "species": "A particularly good-looking human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/landocalrissian_thumb.jpg",
    "vehicle": "Millennium Falcon",
    "weapon": "Blaster pistol, devastating smile",
    "name": "Lando Calrissian",
    "gender": "Male",
    "homeworld": "Unknown",
    "affiliation": "Rebel Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/landocalrissian_detail.png",
    "biography": "Card player, gambler, scoundrel... Lando Calrissian preferred to operate outside the jurisdiction of the Empire. As administrator of Cloud City, a Tibanna gas mining facility hovering in the atmosphere of the planet Bespin, Lando welcomes his old friend Han Solo along with Leia, Chewbacca, Artoo and Threepio after their harrowing escape from the Empire on Hoth. But not all was what it seemed -- Lando had in fact made a deal with Darth Vader to capture the unfortunate Captain Solo in exchange for the security of Cloud City and its people. It was a deal Calrissian was set up to lose.\nWith Solo captured, frozen in carbonite, and taken to the vile gangster Jabba the Hutt, Lando recognized the gravity of his betrayal and seized the initiative to redeem himself. After freeing Solo's friends and warning Cloud City's residents of the impending Imperial takeover, he fled with Leia and the others to the Rebel Alliance where he helped mount Han Solo's rescue from Jabba the Hutt. Later, as a general in the Alliance, Calrissian led a starfighter attack which resulted in the destruction of the Empire's second Death Star."
  },
  {
    "title": "Ambitious Cadet",
    "height": "1.65 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/korkie_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Korkie",
    "gender": "Male",
    "homeworld": "Mandalore",
    "affiliation": "Neutral",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/korkie_detail.png",
    "biography": "The nephew of Duchess Satine Kryze, Cadet Korkie attended the Royal Academy of Government on Mandalore, where he was being groomed for leadership. His keen insights and ambitious personality suggested that he would go far."
  },
  {
    "title": "Fights Under the Name Maximo",
    "height": "1.63 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/technology/ko5d_relationship.png",
    "vehicle": "",
    "weapon": "Built-in flamethrower ",
    "name": "K0-5D",
    "gender": "",
    "homeworld": "",
    "affiliation": "Pirate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/technology/ko5d_detail.png",
    "biography": "K0-5D began function as a general purpose ASP droid, but it has been extensively modified for gladiatorial combat. Fighting aboard the sparring pits of the Weequay pirate ship Marauder, K0-5D usually emerges triumphant, thanks to its powerful, steel-shredding servos and his integrated flame thrower. For his fighting prowess, the Weequays have taken to calling it \"Maximo.\""
  },
  {
    "title": "Battlefield Medic",
    "height": "1.83 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kix_thumb.jpg",
    "vehicle": "BARC speeder",
    "weapon": "Blaster rifle",
    "name": "Kix",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kix_detail.png",
    "biography": "Kix served as a medic in the 501st Legion of clone troopers. He is equipped with medpacs and other first aid equipment to help tend to his fellow squadmates in the thick of battle. Though Kix is dedicated to preserving the life of his fellow brothers, he has no qualms about fighting the enemy. Stencilled across his head is the phrase, \"a good droid is a dead one\" as testament to his mettle."
  },
  {
    "title": "Anakin's Best Pal",
    "height": "1.24 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kitster_thumb.jpg",
    "vehicle": "eopie",
    "weapon": "",
    "name": "Kitster",
    "gender": "Male",
    "homeworld": "Tatooine",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kitster_detail.png",
    "biography": "Kitster was one of Anakin Skywalker's friends before the young Podracing champ left Tatooine for the life of a Jedi. An optimistic human boy about the same age as Anakin, Kitster was part of Anakin's pit team in the fateful Boonta Eve Classic race that saw young Skywalker win his freedom."
  },
  {
    "title": "Aquatic Jedi Master",
    "height": "1.96 meters",
    "species": "Nautolan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kitfisto_thumb.jpg",
    "vehicle": "Jedi starfighter",
    "weapon": "Lightsaber",
    "name": "Kit Fisto",
    "gender": "Male",
    "homeworld": "Glee Anselm",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kitfisto_detail.png",
    "biography": "Kit Fisto is a striking example of an alien Jedi, a Nautolan with large eyes, and a gathered tangle of flexible tentacle-tresses extending from his head. He is at home in the waters of aquatic planets, like his native Glee Anselm. As a Jedi Master, Fisto has an intense focus, particularly in combat. He is also much more laid back and capable of enjoying a hearty chuckle than some of his humorless colleagues, however."
  },
  {
    "title": "Leader of the Aleena",
    "height": ".78 meters",
    "species": "Aleena",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kingmanchucho/kingmanchucho_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "King Manchucho",
    "gender": "Male",
    "homeworld": "Aleen",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kingmanchucho/kingmanchucho_detail.png",
    "biography": "The leader of the Aleena, King Manchucho was a fair and intelligent leader. He was gregarious and eager to please, always serving as a welcome host to any off-world guests. Manchucho wanted a peaceful coexistence with the beings that lived beneath the surface of his planet, even though their ways and culture remained alien to him."
  },
  {
    "title": "Two-Time Winner of the Obsidian Sphere",
    "height": "1.68 meters",
    "species": "Weequay",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kieraswan_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster rifle",
    "name": "Kiera Swan ",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Bounty hunter, pirate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kieraswan_detail.png",
    "biography": "Pirates and bounty hunters rarely mix well; the former group is devoted to breaking interstellar shipping laws and the latter are licensed to hunt criminals, they often wind up on the opposite ends of intense and destructive blaster-fights. But Kiera Swan was skilled enough to make the transition from notorious Weequay pirate, to legendary bounty hunter. With a price on her head from her ship-raiding past, Kiera tended to accept illegal bounties and avoided working closely with other hunters, since she didn't trust them."
  },
  {
    "title": "Cerean Jedi Master",
    "height": "1.98 meters",
    "species": "Cerean",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kiadimundi_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Ki-Adi-Mundi",
    "gender": "Male",
    "homeworld": "Cerea",
    "affiliation": "Galactic Republic, Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/kiadimundi_detail.png",
    "biography": "Ki-Adi-Mundi was a Cerean alien who sat on the Jedi Council. A humanoid being, Ki's most distinguishing physical feature was an enlarged conical cranium that contained a binary brain. When Jedi Master Qui-Gon Jinn reported a Sith attack during the events surrounding the Battle of Naboo, Ki-Adi-Mundi expressed shock at the notion. \"Impossible,\" he remarked, \"the Sith have been extinct for a millennium.\" He also failed to see how far Count Dooku had fallen from the Jedi ideals just prior to the Clone Wars, believing that Dooku was incapable of violence or murder. The Clone Wars were a harsh education for the serene Jedi Master, as he was pressed into service as a battlefield general. Ki-Adi-Mundi served on hostile, exotic worlds such as Geonosis and Mygeeto."
  },
  {
    "title": "Zygerrian Slavemaster",
    "height": "1.97 meters",
    "species": "Zygerrian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/keeperagruss_thumb.jpg",
    "vehicle": "Repulsorlift chair",
    "weapon": "electro-whip",
    "name": "Keeper Agruss",
    "gender": "Male",
    "homeworld": "Zygerria",
    "affiliation": "Zygerrian Slave Empire, Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/keeperagruss_detail.png",
    "biography": "A Zygerrian slavemaster who led the slaving operation on Kadavo, Agruss delighted in his superiority over his pathetic charges. Agruss flaunted his power freely, punishing and executing slaves at a whim to ensure no one every questioned his authority. The overweight Zygerrian hovered aloft on a repulsorlift chair, exuding an air of decadence. Agruss particularly delighted in tormenting Obi-Wan Kenobi, the first ever Jedi to be interred at his grueling facility."
  },
  {
    "title": "Monarch of Toydaria",
    "height": "1.52 meters",
    "species": "Toydarian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/katuunko_thumb.jpg",
    "vehicle": "Thief's Eye personal yacht",
    "weapon": "Ceremonial saber",
    "name": "King Katuunko",
    "gender": "Male",
    "homeworld": "Toydaria",
    "affiliation": "Neutral at first, but later Republic-allied",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/katuunko_detail.png",
    "biography": "The sovereign ruler of the Toydarians, King Katuunko valued honesty above all else. He was chiefly concerned with protecting his people from the ravages of the Clone Wars, and was hesitant to ally himself to either the Republic or Separatist factions. After Master Yoda impressed Katuunko with a display of Jedi character, Katuunko committed his world to support the Republic."
  },
  {
    "title": "Chief Librarian",
    "height": "1.69 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jocastanu_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Jocasta Nu",
    "gender": "Female",
    "homeworld": "Coruscant",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jocastanu_detail.png",
    "biography": "The Jedi Archives are the galaxy's greatest repository of knowledge, and Madame Jocasta Nu is their Chief Librarian. She helps other Jedi find information in the Archive using its data terminals, and she controls access to the restricted contents of its Holocron Vault. Jocasta Nu can sometimes be too confident in thinking that the Archives contain the correct answers to all questions."
  },
  {
    "title": "Youngling Castaway",
    "height": "1.76 meters",
    "species": "Twi'lek",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jinx_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Jinx",
    "gender": "Male",
    "homeworld": "Ryloth",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jinx_detail.png",
    "biography": "A Twi'lek youngling, Jinx's optimism was chipped away by the harsh realities of survival in the Wasskah jungle. Gifted in the Force, he longed to return to the Jedi Temple but feared he may be forced to spend the rest of his days outrunning deadly Trandoshan hunters."
  },
  {
    "title": "Proud Republic Soldier",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jesse_thumb.jpg",
    "vehicle": "BARC speeder",
    "weapon": "Blaster rifle",
    "name": "Jesse",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jesse_detail.png",
    "biography": "The clone troopers of the 501st Legion are a tight-knit bunch, loyal to the end to their Jedi General, Anakin Skywalker. Jesse was a hard-fighting patriot who proudly wore the cog-shaped symbol of the Galactic Republic on his helmet, and as a large tattoo that covered his face."
  },
  {
    "title": "Misfit Mechanic",
    "height": "1.4 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jaybohood_thumb.jpg",
    "vehicle": "",
    "weapon": "Reprogrammed battle droids",
    "name": "Jaybo Hood",
    "gender": "Male",
    "homeworld": "Iego",
    "affiliation": "Neutral",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jaybohood_detail.png",
    "biography": "The young boy Jaybo Hood tinkered with battle droids to create an army of servants while living captive on the planet Iego during the Clone Wars. With his technical expertise, Jaybo helped Jedi Anakin Skywalker and Obi-Wan Kenobi leave Iego without injury."
  },
  {
    "title": "Gungan Outcast",
    "height": "1.96 meters",
    "species": "Gungan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jarjarbinks_thumb.jpg",
    "vehicle": "Gungan bongo, kaadu",
    "weapon": "Electropole, cesta, boomer",
    "name": "Jar Jar Binks",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Gungan Grand Army, Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jarjarbinks_detail.png",
    "biography": "A clumsy, well-meaning Gungan outcast on Naboo, Jar Jar Binks struggled to prove his worth throughout his life. Putting his awkward past behind him, Jar Jar left the swamps of Naboo to enter the even murkier waters of Coruscant politics, becoming a representative for his people in the galactic capital. There, his best intentions and eagerness to serve were exploited by scheming Senators and others in positions of power."
  },
  {
    "title": "Bounty Hunter",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jangofett_thumb.jpg",
    "vehicle": "Slave I, rocket pack",
    "weapon": "Blaster rifle, flame projector, rocket darts, vibroblade",
    "name": "Jango Fett",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jangofett_detail.png",
    "biography": "In the final years of the Republic, Jango Fett was regarded as the best bounty hunter in the galaxy. A proficient marksman and unarmed combatant, Fett was covered in a sleek armored suit that concealed his scarred face. His combat gear featured an arsenal of weaponry, including retractable wrist blades, a snare, dual blaster pistols and other more exotic tools of the trade.\nIn combat, Jango used his harnessed jetpack to gain the advantage of speed and height over his enemies. The backpack also carried a nasty surprise -- an explosive rocket could be launched from it. For interstellar travel, Jango traveled aboard his well-worn starship, Slave I."
  },
  {
    "title": "Deadly Rodian",
    "height": "1.74 meters",
    "species": "Rodian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jakoli_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster pistol",
    "name": "Jakoli",
    "gender": "Male",
    "homeworld": "Rodia",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jakoli_detail.png",
    "biography": "The jungles of Rodia have fostered the idealization of hunters in Rodian culture. Many unqualified rookies attempt to secure respect and accolades by entering the bounty hunting profession, only to find their lives cut short by underestimated prey. Jakoli avoided such a fate by being as ruthless as possible, and never taking chances by bagging live acquisitions. To Jakoli, there was no \"dead or alive\" for his targets; only \"dead.\""
  },
  {
    "title": "His High Exaltedness",
    "height": "3.9 meters long",
    "species": "Hutt",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jabba_thumb.jpg",
    "vehicle": "Sail barge",
    "weapon": "",
    "name": "Jabba the Hutt",
    "gender": "Male",
    "homeworld": "Tatooine",
    "affiliation": "Criminal",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/jabba_detail.png",
    "biography": "A loathsome slug of a gangster, Jabba the Hutt was the preeminent kingpin of crime in the Outer Rim Territories. Basing his operations out of Tatooine, the Hutt had his pudgy fingers in a number of criminal activities -- slavery, gunrunning, spice-smuggling, extortion and more.\nA hefty Hutt, Jabba resembled a worm-like slug, with a legless, tapered body coated in slime. Jabba surrounded himself with some of the worst thugs in the galaxy, ensuring his protection with a screen of henchmen and hired guns. He lived in a palace out in the Tatooine deserts."
  },
  {
    "title": "Unlikely Coruscant Criminal",
    "height": "1.78 meters",
    "species": "Unknown",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ionemarcy_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Ione Marcy",
    "gender": "Female",
    "homeworld": "Coruscant",
    "affiliation": "Criminal",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ionemarcy_detail.png",
    "biography": "Ione's large eyes and small voice help her maintain her illusion of being an innocent witness to the crimes found in the deeper levels of Coruscant. Few would suspect her as a thief or accomplice to murder. Ione was a partner in crime to the nimble Cassie Cryar. When the two hoods managed to get a hold of a stolen Jedi lightsaber, they desperately tried to avoid the law."
  },
  {
    "title": "Assassin Droid",
    "height": "1.96 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ig88_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster rifle, heavy pulse cannon",
    "name": "IG-88 ",
    "gender": "",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ig88_detail.png",
    "biography": "Many people in the galaxy fear droids, what with the memories of the Clone Wars still fresh in their minds. Far more terrifying than battle droids were assassin droids, independently programmed mechanical killers that had no masters. IG-88 is a battered chrome war droid who has become a bounty hunter, and answered Darth Vader's call to capture the Millennium Falcon during the events surrounding the Battle of Hoth."
  },
  {
    "title": "Scourge of the Space Lanes",
    "height": "1.85 meters",
    "species": "Weequay",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/hondoohnaka_thumb.jpg",
    "vehicle": "Repulsortank, saucer ship",
    "weapon": "Vibroblade, blaser pistol, electropole",
    "name": "Hondo Ohnaka",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Pirate",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/hondoohnaka_detail.png",
    "biography": "A tough, pragmatic Weequay, Hondo Ohnaka leads a notorious Outer Rim pirate gang from his headquarters on Florrum. A former colleague of Jango Fett and a former lover of Aurra Sing, Ohnaka won fame during the Clone Wars when he kidnapped Count Dooku, Obi-Wan Kenobi, and Anakin Skywalker and tried to ransom all three for a big payout."
  },
  {
    "title": "Great Ruler of Patitite Pattuna",
    "height": ".43 meters tall",
    "species": "Patitite",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/hayzu_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Hay-Zu",
    "gender": "Male",
    "homeworld": "Patitite Pattuna",
    "affiliation": "Neutral",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/hayzu_detail.png",
    "biography": "The ruler of the Patitites, the Big Hay-Zu did not let his diminutive size contain his ego or sense of entitlement. Indeed, the portly Patitite was a giant among his kind, ruling with the tiniest iron fist. The Patitites did his every bidding, and should a trespasser wander into Patitite territories, watchful scouts like Jimba and Tagoo would lead a hunting party to subdue the interloper. R2-D2 and C-3PO were trussed up and dragged before the Big Hay-Zu during the Clone Wars, leading to a first contact experience that would flatten the hierarchy of power in Patitite society."
  },
  {
    "title": "Hyperactive Clone Trooper",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/hardcase_thumb.jpg",
    "vehicle": "BARC speeder",
    "weapon": "Rotary laser cannon, laser rifle",
    "name": "Hardcase",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/hardcase_detail.png",
    "biography": "\"Let me at 'em!\" was Hardcase's typical reaction when presented with enemy forces, no matter how overwhelming the odds. Legend has it that his growth chamber sprung a leak during his formation on Kamino, resulting in his characteristic, somewhat aberrant, but nonetheless useful hyperactivity. When the blaster bolts fly, Hardcase loses all sense of self-preservation and returns fire with zeal, determined to wipe out the enemy with repeated sweeps of his rotary laser cannon."
  },
  {
    "title": "Corellian Scoundrel",
    "height": "1.8 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/hansolo_thumb.jpg",
    "vehicle": "Millennium Falcon",
    "weapon": "Heavy blaster pistol",
    "name": "Han Solo",
    "gender": "Male",
    "homeworld": "Corellia",
    "affiliation": "Rebel Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/hansolo_detail.png",
    "biography": "An outlaw smuggler with a heart of gold, Han Solo proved his heroism after he got mixed up with the Rebel Alliance in their fight against the Empire. Han and his co-pilot Chewbacca flew the freighter Millennium Falcon to help the Rebels destroy the Death Star, but when Jabba the Hutt placed a price on his head, he was frozen in a carbonite slab and hung in Jabba's palace. His friends, including Luke Skywalker, Princess Leia, and Lando Calrissian, rescued Han in time for him to lead the ground attack that led to a Rebel triumph in the Battle of Endor."
  },
  {
    "title": "Kaminoan Senator",
    "height": "2.13 meters",
    "species": "Kaminoan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/halleburtoni_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Halle Burtoni",
    "gender": "Female",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/halleburtoni_detail.png",
    "biography": "The strong-willed female Kaminoan Senator is well-respected in both the Galactic Senate and in her own world of Kamino which is known for its production of the clone troopers. The aged Kaminoan bartered her clone production efforts into a seat in the Senate, and she longed for nothing more than to see Padme's peace-promoting efforts fail. Senator Burtoni's aggressive and intrusive behavior made her not only an intimidating character, but often a suspect in criminal and unethical activities to further her political career."
  },
  {
    "title": "Luckless Bounty Hunter",
    "height": "1.74 meters",
    "species": "Rodian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/greedo_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster pistol, for all the good it did him.",
    "name": "Greedo ",
    "gender": "Male",
    "homeworld": "Tatooine",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/greedo_detail.png",
    "biography": "Greedo was a Rodian bounty hunter with a tapir-like snout, bulbous eyes, pea-green skin, and a crest of spines atop his skull. He was overzealous and a bit slow on the take, not to mention a pretty poor shot with a blaster. Though he fancied himself a big time bounty hunter in the employ of no less an underworld figure than Jabba the Hutt, in truth, no one took him too seriously."
  },
  {
    "title": "Elite Corps Commander",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/gree_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster rifle",
    "name": "Clone Commander Gree",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/gree_detail.png",
    "biography": "Clone Commander Gree, designation 1004, led the Elite Corps of clone troopers during the Clone Wars. He saw deployments on such heated battlefronts as Kashyyyk. Gree himself wore camouflaged armor to better blend into jungle surroundings. Though a faithful commander who carried out the Jedi's orders, Gree was ultimately loyal to the Republic. When Chancellor Palpatine enacted Order 66, Gree understood it was a worst-case scenario contingency -- the Jedi had betrayed the Republic, and were therefore dangerous enemies of the state."
  },
  {
    "title": "Governor of Kiros",
    "height": "1.98 meters",
    "species": "Togruta",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/governorroshti_thumb.jpg",
    "vehicle": "",
    "weapon": "None",
    "name": "Governor Roshti",
    "gender": "Male",
    "homeworld": "Kiros",
    "affiliation": "Neutral",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/governorroshti_detail.png",
    "biography": "An elder Togruta, Roshti governed the artisan colony of Kiros during the Clone Wars. A quiet and reserved man, Roshti only wanted peace for himself and his fellow Togruta. He tried to remain apart from the Clone Wars, taking no stance in the battle between Republic and Separatist forces. But when Count Dooku arrived on the planet, forcing his brand of \"protection\" onto Kiros, Roshti was compelled to obey. Dooku offered the Togruta sanctuary -- but an alliance with the Zygerrians meant that the entire colony of 50,000 Togruta were transported to the deplorable mining installation on Kadavo, a grueling facility fueled by the toil of slaves."
  },
  {
    "title": "Stern Master",
    "height": "2.36 meters",
    "species": "Besalisk",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/generalpongkrell_thumb.jpg",
    "vehicle": "",
    "weapon": "Two double-ended lightsabers",
    "name": "General Pong Krell",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Galactic Republic, Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/generalpongkrell_detail.png",
    "biography": "This Besalisk Jedi is all about getting results and, indeed, his battlefield record lists many key victories in the Clone Wars. He has an unshakable confidence in his methods, and he will brook no insubordination among his charges. In personal combat, he can be ferocious -- his giant arms carry two double-ended lightsabers, making him extremely dangerous in close quarters. Pong Krell's reputation as a successful general is well known but so is the fact that the casualty rates of the clone troopers under his command are the highest."
  },
  {
    "title": "Ruthless Cyborg Warmaster",
    "height": "2.16 meters",
    "species": "Kaleesh cyborg",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/generalgrievous_thumb.jpg",
    "vehicle": "Starfighter, Separatist dreadnaught, Separatist frigate, Separatist destroyer, wheel bike",
    "weapon": "Blaster rifle, electropole, stolen lightsabers ",
    "name": "General Grievous",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/generalgrievous_detail.png",
    "biography": "General Grievous is a brilliant military strategist who can't be bothered with compassion or mercy. His lightning strikes and effective battle planning made him infamous in the eyes of a frightened Republic. A twisted melding of flesh and metal, General Grievous' body is a deadly weapon. Grievous' living matter was encased within his precision-engineered artificial body; inside the hardened shell beat the heart of a remorseless killer. A pressurized gut-sack held his vital organs, while his skull-like mask contained his living eyes and brain. Each of his six-fingered arms could split in two, resulting in an array of four limbs, each armed with a lightsaber that he would take as a grim trophy of his victims. Grievous could spin these arms in a whirling storm of deadly light. For all his imposing image, Grievous is a coward at heart. Only with opponents he believes he can defeat does he enter into combat. His hacking cough and thirst for winning every battle at any cost made him Enemy Number One in the eyes of the Jedi Council."
  },
  {
    "title": "Dexterous Daredevil",
    "height": "1.22 meters",
    "species": "Xexto",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/gasgano_thumb.jpg",
    "vehicle": "Ord Pedrovia Podracer",
    "weapon": "",
    "name": "Gasgano",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Boonta Eve Podracers",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/gasgano_detail.png",
    "biography": "A slight, spindly, six-armed alien, Gasgano was a thrill-seeker uniquely suited to the extreme sport of Podracing. Gasgano was very competitive, and sought to beat racers Anakin Skywalker and Sebulba during the Boonta Eve Podrace. He piloted a green Ord Pedrovia Podracer in the competition."
  },
  {
    "title": "Reptilian Hunter",
    "height": "2.1 meters",
    "species": "Trandoshan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/garnac_thumb.jpg",
    "vehicle": "MSP80 Pteropter hunting pod",
    "weapon": "Blaster rifle, blaster pistols, hunting knife",
    "name": "Garnac",
    "gender": "Male",
    "homeworld": "Trandosha",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/garnac_detail.png",
    "biography": "The ferocious leader of a lodge of Trandhoshan hunters, Garnac savored the thrill of stalking prey through the underbrush of Wasskah. He proudly watched as his son, Dar, took up the hunt, but had not counted on the resilience of their Padawan quarry."
  },
  {
    "title": "Podrace Announcers",
    "height": "1.96 meters",
    "species": "Troig",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/fodeandbeed_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Fode and Beed",
    "gender": "",
    "homeworld": "",
    "affiliation": "Boonta Eve Podracers",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/fodeandbeed_detail.jpg",
    "biography": "Flamboyant, colorful and not always too accurate, Fode and Beed were the popular announcers of the Boonta Eve Podrace. The two were well suited for their chosen vocation -- they were a two-headed alien that shared a single body. Fode, whose skin was tinted red, provided commentary in an easy Basic drawl, while Beed, the green-hued head, provided counterpoint in Huttese."
  },
  {
    "title": "Balance of the Force",
    "height": "2.48 meters (apparent)",
    "species": "Force wielder",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/father_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Father ",
    "gender": "Male",
    "homeworld": "Mortis",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/father_detail.png",
    "biography": "In the mysterious realm of Mortis there exists a trio of beings able to wield the Force in ways no known mortals of the galaxy can. The Father maintained balance between his Daughter and his Son, who expressed affinity to the light and dark side of the Force, respectively. The Father knew his days were numbered -- facing his impending demise, he needed to find another to keep the balance. His goal was the same described in an ancient Jedi prophecy -- the rise of a Chosen One who will bring balance to the Force."
  },
  {
    "title": "Not Into Small Talk",
    "height": "1.99 meters",
    "species": "Kyuzo",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/embo_thumb.jpg",
    "vehicle": "Halo",
    "weapon": "Bowcaster",
    "name": "Embo",
    "gender": "Male",
    "homeworld": "Phatrong",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/embo_detail.png",
    "biography": "A fearsome bounty hunter of few words, Embo was quick to disable his target, be it by a single trained shot from his bowcaster or a decisive blow from his pan-shaped hat, which could be hurled at an adversary with deadly accuracy. The hat also doubled as a shield when the Kyuzo directly charged his target head-first. Embo appeared loyal to Sugi and her band of bounty hunters, a group which possesses a rare sense of honor among outlaws."
  },
  {
    "title": "Jedi Council Member",
    "height": "1.87 meters",
    "species": "Zabrak",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/eethkoth_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Eeth Koth",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/eethkoth_detail.png",
    "biography": "Eeth Koth was a member of the Jedi High Council in the final years of the order. From within the polished towers of the Jedi Temple on Coruscant, the Council governed the actions of the Jedi Knights. Koth was one of the 12 Jedi present when Qui-Gon Jinn presented Anakin Skywalker as the Chosen One to the Council. A determined warrior with a deep, spiritual connection to the Force, Koth resisted torture at the hands of General Grievous during the Clone Wars, and was even able to secretly communicate his location to the Jedi Council. Koth was saved from Separatist clutches by the daring efforts of his fellow Jedi."
  },
  {
    "title": "Proponent of Peace",
    "height": "1.77 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/duchesssatine_thumb.jpg",
    "vehicle": "Coronet passenger liner",
    "weapon": "Deactivator hold-out pistol",
    "name": "Duchess Satine Kryze",
    "gender": "Female",
    "homeworld": "Mandalore",
    "affiliation": "Neutral",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/duchesssatine_detail.png",
    "biography": "The leader of Mandalore during the Clone Wars, Duchess Satine of Kalevala was a controversial figure. She longed to move Mandalore beyond its violent past and instituted a government that valued pacifism. Though Mandalore did begin to rebuild under her guidance, the dark shadow of the Clone Wars made the Duchess' goals difficult to achieve. Not wanting to be mired in galactic conflict, the Duchess declared her planet neutral. This isolation brought hardship to Mandalore, and gave the Death Watch -- a violent faction of Mandalorians -- opportunity to ally with the Separatists and target the Duchess for assassination."
  },
  {
    "title": "Leader of the Separatists",
    "height": "1.93 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/dooku_thumb.jpg",
    "vehicle": "Geonosian solar sailer",
    "weapon": "Lightsaber",
    "name": "Count Dooku",
    "gender": "Male",
    "homeworld": "Serenno",
    "affiliation": "Separatist Alliance, Sith, former Jedi",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/countdooku_detail.png",
    "biography": "A former Jedi Knight who left the Order when he became disillusioned with the corruption in theRepublic, Dooku is the public face of the Separatist Alliance leadership. Many see him as a charismaticpolitician, but he has in truth been corrupted to the dark side by Darth Sidious."
  },
  {
    "title": "Rookie Clone Trooper",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/dogma_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster rifle",
    "name": "Dogma",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/dogma_detail.png",
    "biography": "Fervently loyal to the Galactic Republic, trooper Dogma was one of the newer generation of clone troopers fighting on the frontlines of the Clone Wars. Unlike seasoned veterans like Clone Captain Rex and ARC Trooper Fives, Dogma was more rigid in his thinking, easily -- and eagerly -- submitting to appropriate authority. When clones troopers of the 501st began grousing about General Krell's obstinate and dangerous command style, Dogma jumped to defend their commander. Dogma supported the general -- and passionately believed in their duty to carry out his orders."
  },
  {
    "title": "Well-Connected Cook",
    "height": "1.88 meters",
    "species": "Besalisk",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/dexterjettster_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Dexter Jettster",
    "gender": "Male",
    "homeworld": "Coruscant",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/dexterjettster_detail.png",
    "biography": "A Jedi on an investigation has access to almost limitless information within the confines of the Jedi Temple, but not even those records are complete. When Obi-Wan's search for the origins of a mysterious dart used to kill an assassin stalled, he turned to an old friend in Coco Town.Few would look at Dexter Jettster and instantly think \"gourmand,\" but the burly four-armed alien added successful cook and diner proprietor to the long list of careers he had experienced in his checkered life. Obi-Wan counted on Dex to identify the enigmatic weapon, and Jettster didn't fail him.\nThe cook correctly recognized the small tined projectile as a Kamino saberdart, a weapon he hadn't seen since his prospecting days on Subterrel, beyond the Outer Rim. Few have ever heard of the planet Kamino, but Dex not only informed Obi-Wan as to its location (12 parsecs south of the Rishi Maze), but also its inhabitants. Dex warned that the native Kaminoans -- cloners of some repute -- keep to themselves, but are welcoming to those with the credits to spare."
  },
  {
    "title": "The Executioner",
    "height": "2.21 meters",
    "species": "Parwan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/derrown_thumb.jpg",
    "vehicle": "",
    "weapon": "Twin blaster pistols, shoulder-mounted cannon, bio-electric shocks",
    "name": "Derrown",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/derrown_detail.png",
    "biography": "It's easy to misjudge the deadliness of a gasbag. Derrown was a Parwan bounty hunter, an alien species with a lighter-than-air physiology that allowed him to float about on air currents, anchoring himself with four leg-like tentacles and two arms. His buoyancy let him reach heights and vantage points not easily accessible to standard density competitors, but he lacked the speed and control that came with mass. The Parwan biology produces intense electrical fields -- Derrown literally crackled with energy, earning him the grisly moniker the Executioner. To prevent any ill-effects with his carried explosives, he kept them safe in an insulated bandolier across his shoulders."
  },
  {
    "title": "Trade Federation Captain",
    "height": "1.9 meters",
    "species": "Neimoidian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/daultaydofine_thumb.jpg",
    "vehicle": "Trade Federation battleship, Droid Control Ship",
    "weapon": "",
    "name": "Daultay Dofine",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Trade Federation",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/daultaydofine_detail.png",
    "biography": "The unctuous captain of the Neimoidian blockade over Naboo, Dofine was an officer in the Trade Federation. Greedy, deceitful and cowardly, Dofine nevertheless had the wherewithal to openly question Darth Sidious' machinations, for which he was verbally reprimanded by the Sith Lord. Despite his insubordination, Dofine remained in command of the blockade's forces. He gave the order to activate the droids on the surface of Naboo. Dofine perished aboard the Droid Control Ship when Naboo starfighter forces destroyed the vessel."
  },
  {
    "title": "The Power of Light",
    "height": "2.13 meters (apparent)",
    "species": "Force wielder ",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/daughter_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Daughter",
    "gender": "Female",
    "homeworld": "Mortis",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/daughter_detail.png",
    "biography": "The Daughter of Mortis is a Force-wielder who aligns herself with the light side of the Force. An enigmatic being of tall stature who can transform into a griffin, she is the selfless counterpoint to her brother, the Son, who has allied himself with the dark side. Together they provide balance to the Force, a balance maintained and channeled through their Father."
  },
  {
    "title": "Proud Zygerrian",
    "height": "1.89 meters",
    "species": "Zygerrian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/dartsdnar_thumb.jpg",
    "vehicle": "Tecora Zygerrian Slave Ship",
    "weapon": "electro-whip",
    "name": "Darts D'Nar",
    "gender": "Male",
    "homeworld": "Zygerria",
    "affiliation": "Zygerrian Slave Empire, Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/dartsdnar_detail.png",
    "biography": "A proud Zygerrian, Darts D'Nar longs for the days when Zygerria is once again an influential power in the galaxy. He believes an alliance with Count Dooku and the Separatists is a step in the path towards rebuilding this former glory, though he is often impatient at the Count's indirect means. To D'Nar, power not flexed is power wasted.\nWith relish, he supervises the conquest of Kiro, and the forced relocation of thousands of Togruta colonists. His devious mind concocted the explosive insurance plan of hiding bombs throughout the colony, to keep the hated Jedi distracted and give him authority over their attempts at negotiation.\nA powerfully built Zygerrian, Darts D'Nar is a master of the electro-whip. He treats slaves as he does the beasts of his growing menagerie -- as curious trophies to be proudly displayed."
  },
  {
    "title": "Dark Lord of the Sith",
    "height": "2.03 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/darthvader_thumb.jpg",
    "vehicle": "Super Star Destroyer, modified TIE fighter",
    "weapon": "Lightsaber",
    "name": "Darth Vader",
    "gender": "Male",
    "homeworld": "Tatooine",
    "affiliation": "Sith",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/darthvader_detail.png",
    "biography": "Once a Jedi Knight, Anakin Skywalker swore loyalty to Sith Lord Darth Sidious in order to gain the power of the dark side of the Force. Vader betrayed the Jedi Order and his Master, Obi-Wan Kenobi. With the rise of the Galactic Empire, Darth Vader became the Emperor's dark enforcer. He carried out the Emperor's will, and commanded legions of Imperial troops. Vader was tasked with discovering the secret headquarters of the Rebel Alliance, as well as chasing down the Rebels who destroyed the Empire's massive Death Star battle station.\nDarth Vader was encased in sinister black armor. The man underneath was mortally wounded in a lightsaber duel, and the dark suit includes extensive machinery to keep Vader alive. The sounds of his mechanical lungs accompany his every step. Such injuries greatly diminished his ability to use the Force, but Vader is still very powerful. He can command the power of the dark side to hurl objects or remotely crush the throats of his victims."
  },
  {
    "title": "Shadowy Sith Lord",
    "height": "1.78 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/darthsidious_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber, Force lightning",
    "name": "Darth Sidious",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Sith, Galactic Empire",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/darthsidious_detail.png",
    "biography": "Darth Sidious is the name assumed by Palpatine when he became a Sith Lord. In time, the Sith identity became more real than Palpatine's public face. After the Clone Wars and his ascension to Emperor, Palpatine essentially lived as Sidious for the remainder of his life."
  },
  {
    "title": "Weapon of the Dark Side",
    "height": "1.75 meters",
    "species": "Dathomirian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/darthmaul_thumb.jpg",
    "vehicle": "Sith speeder, Sith infiltrator",
    "weapon": "Double-bladed lightsaber",
    "name": "Darth Maul",
    "gender": "Male",
    "homeworld": "Dathomir",
    "affiliation": "Sith",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/darthmaul_detail.png",
    "biography": "Darth Maul began life as one of the Nightbrothers on Dathomir. Darth Sidious brutally trained his apprentice to be a weapon of the Sith. Maul was not a schemer like his mentor, but a relentless and acrobatic warrior with an extremely dangerous double-ended lightsaber. Maul longed for revenge against the Jedi, to destroy the Order and restore power to the Sith."
  },
  {
    "title": "Republic Deserter",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/cutlawquane_thumb.jpg",
    "vehicle": "eopie",
    "weapon": "Blaster rifle, blaster pistol",
    "name": "Cut Lawquane",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Formerly Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/cutlawquane_detail.png",
    "biography": "A disillusioned clone trooper who saw too many of his fellow brothers die in combat, Cut Lawquane left the service. The deserter attempted to carve a new life for himself as a simple farmer on Saleucami. He wants only to live in peace with his new family, his wife Suu and his children, Jek and Shaeeah. He finds, however, that nowhere is safe from the Clone Wars."
  },
  {
    "title": "Hooked Predators",
    "height": "About 40 meters long",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/coloclawfish_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "colo claw fish",
    "gender": "",
    "homeworld": "",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/coloclawfish_detail.png",
    "biography": "A powerful, aquatic carnivore lurking near Naboo's core. The monstrous animal has long jaws filled with pointed teeth. Its forelegs end in wicked claws, and sharp protrusions jut from its luminescent tail. The colo claw fish hides in underwater tunnels, where it sits motionless for hours until suitable prey passes by. When it spots a victim, the beast erupts from its lair and grabs the meal in its claws. Although quite fearsome, the colo claw fish is no match for the enormous sando aqua monster."
  },
  {
    "title": "Leader of the Wolfpack",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/clonecommanderwolffe_thumb.jpg",
    "vehicle": "Jedi transport, Republic attack gunship, rocket pack",
    "weapon": "Blaster pistol, blaster rifle, thermal detonator",
    "name": "Clone Commander Wolffe",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/clonecommanderwolffe_detail.png",
    "biography": "Clone Commander Wolffe (clone designation CC-3636) served under General Plo Koon in the Clone Wars, as commander of the tight-knit unit known as the Wolfpack. A seasoned and battered combatant, Wolffe has witnessed some of the worst the war has to offer. Early in the Clone Wars, he lost his entire command when Master Plo's flagship, Triumphant, was destroyed by the despicable General Grievous. Despite such tragedy, he fights on bravely, proudly brandishing his battle scars and instilling loyalty among his men."
  },
  {
    "title": "Obi-Wan's Clone Commander",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/clonecommandercody_thumb.jpg",
    "vehicle": "Republic gunship",
    "weapon": "Blaster rifle",
    "name": "Clone Commander Cody",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/clonecommandercody_detail.png",
    "biography": "A natural and practical leader in the clone army, Cody was a good fit for General Kenobi, to whom he was particularly loyal. Cody's keen ability to strategize, combined with his fierce combat style in the heat of battle, earned him the respect of the Jedi, and of his fellow clones as well. He often worked with Captain Rex, with whom he became friends. Cody enjoyed a close relationship with Kenobi, often sharing a tension-busting joke with him during intense moments on the battlefield. When Darth Sidious gave Order 66, however, Cody's loyalty to Kenobi was eclipsed by his clone indoctrination, and he ordered his troops to fire on the Jedi."
  },
  {
    "title": "Unlikely Hero",
    "height": "1.68 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/clone99_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "clone 99",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/clone99_detail.png",
    "biography": "During the Clone Wars, Clone 99 was a malformed result of the cloning process. Due to his genetic defects and physical limitations, he was considered unfit for combat, and remained behind on Kamino to support the training efforts of his clone \"brothers.\" Though his responsibilities were menial and his job consisted primarily of janitorial duties, he took pride in his work and in his connection to the Republic's noble heroes. Despite (or perhaps because of) his physical shortcomings, Clone 99 was gentle, thoughtful and wise, offering a unique perspective for cadets facing the rigors of military training. During the Separatist invasion of Tipoca City, he assisted a group of clone cadets in their defense of the cloning facility."
  },
  {
    "title": "Ming Po Leader",
    "height": "1.72 meters",
    "species": "Ming Po",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/chieftainpieter_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Chieftain Pieter",
    "gender": "Male",
    "homeworld": "Carlac",
    "affiliation": "Ming Po villager",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/chieftainpieter_detail.png",
    "biography": "The elder leader of a town of Ming Po on Carlac, Chieftain Pieter hated the intruding Death Watch and their bullying ways. The marauding gang set up camp next to Pieter's town, and kidnapped many of the defenseless townspeople to toil as their servants. Pieter bravely confronted Vizsla, demanding the return of his people. Vizsla appeared to concede, but it was all a cruel ploy to teach Pieter a painful lesson."
  },
  {
    "title": "Walking Carpet",
    "height": "2.28 meters",
    "species": "Wookiee",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/chewbacca_thumb.jpg",
    "vehicle": "Millennium Falcon",
    "weapon": "Bowcaster",
    "name": "Chewbacca",
    "gender": "Male",
    "homeworld": "Kashyyyk",
    "affiliation": "Rebel Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/chewbacca_detail.png",
    "biography": "An immense, fur covered hero of great strength and loyalty, Chewbacca the Wookiee was a well-known figure in both the underworld and in the Rebel Alliance. Born on Kashyyyk over two centuries before the Battle of Yavin, Chewbacca was a wise, sophisticated being with exceptional skills in starship piloting and repair. He is a gentle giant, with compassionate blue-eyes set within a furry face. If his friends are threatened, though, Chewbacca unleashes his strength in a furious rage."
  },
  {
    "title": "Hero of the Twi'leks",
    "height": "1.9 meters",
    "species": "Twi'lek",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/chamsyndulla_thumb.jpg",
    "vehicle": "Blurgg mount",
    "weapon": "Heavy blaster pistol",
    "name": "Cham Syndulla",
    "gender": "Male",
    "homeworld": "Ryloth",
    "affiliation": "Twi'lek resistance ",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/chamsyndulla_detail.png",
    "biography": "The freedom fighter Cham Syndulla arose on Ryloth during the Clone Wars, after the Separatists invaded his homeworld. A dedicated fighter with no tolerance for corruption or dishonesty, Syndulla forged an alliance with Mace Windu that brought liberty to his fellow Twi'leks."
  },
  {
    "title": "Limber Lightsaber Thief",
    "height": "1.82 meters",
    "species": "Terelian Jango Jumper",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/cassiecryar_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber (Ahsoka's)",
    "name": "Cassie Cryar",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Criminal",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/cassiecryar_detail.png",
    "biography": "The female Terelian Jango Jumper has impressive acrobatics skills which came in handy as a thief in the Coruscant underworld. Cassie Cryar's main objective was to steal highly-sought after objects. By helping her partner Ione Marcy murder her boyfriend, the Trandoshan assassin Nack Movers, Cassie obtained one of the most valuable items in the galaxy -- a Jedi's lightsaber. Her desire to keep the lightsaber made her overconfident. She believed she could wield the same power as a Jedi."
  },
  {
    "title": "The Quickest Eyes on Naboo",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/captainpanaka_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster pistol with ascension gun",
    "name": "Captain Panaka",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Royal Security Forces",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/captainpanaka_detail.png",
    "biography": "Queen Amidala's loyal protector during the Trade Federation invasion crisis was Captain Panaka. Panaka was often referred to as \"the quickest eyes on Naboo\" for his attention to detail and selfless dedication to the safety of the Queen.\nPanaka commanded a team of Royal Palace Guards and Security Troopers stationed throughout Theed. During the Trade Federation invasion, Panaka stayed close to the Queen, ensuring her protection from the Neimoidians' plans. His loyalty was such that he would openly question the strategy of Jedi Knights if he thought it would somehow endanger Amidala."
  },
  {
    "title": "Gun For Hire",
    "height": "1.85 meters",
    "species": "Duros",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/cadbane_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster pistols, flamethrower, bolas, and more",
    "name": "Cad Bane",
    "gender": "Male",
    "homeworld": "Duro",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/cadbane_detail.png",
    "biography": "A ruthless bounty hunter from the planet Duro, Cad Bane was the preeminent blaster-for-hire in the galaxy at the time of the Clone Wars. No quarry was too dangerous for Bane... if the price was right. Using an impressive arsenal of weapons and allies, the cold, cruel and calculating Bane would literally track his prey to the ends of the galaxy if required. Bane carried custom twin blaster pistols, gauntlets studded with control devices, a concealed bola, explosives, integrated breathing apparatus and rocket boots, ensuring that he was always well prepared for any situation that may arise."
  },
  {
    "title": "Fretful Protocol Droid",
    "height": "1.71 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/c3po_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "C-3PO (See-Threepio)",
    "gender": "",
    "homeworld": "Tatooine",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/c3po_detail.png",
    "biography": "Created with discarded scrap metal and parts by a young Anakin Skywalker on Tatooine, C-3PO was originally made to help Anakin's mother Shmi with household chores. Threepio would later meet his lifelong droid friend R2-D2 when Anakin befriended Padme Amidala. Threepio and Artoo would pair up again for many adventures, although the protocol droid dreaded danger and would much rather focus on etiquette and diplomacy. Threepio would later serve useful as a translator for not only Padme in negotiations during the Clone Wars, but also much later for other human companions Princess Leia and Luke Skywalker. The protocol droid's talent for communicating in other languages comes in handy when delegating with Jabba the Hutt, the Talz, and Ewoks."
  },
  {
    "title": "One Half of a Legendary Team",
    "height": "2.27 meters",
    "species": "Ithorian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bulduga_thumb.jpg",
    "vehicle": "Blaster pistols",
    "weapon": "",
    "name": "Bulduga",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bulduga_detail.png",
    "biography": "Most beings in the galaxy assume that Ithorians are peaceful keepers of gardens and contemplative philosophy. The ones who have stared down the barrels of the bounty hunting brothers Bulduga and Onca beg to differ -- if not busy begging for their lives. While Onca favored heavier rifles, Bulduga preferred the fast-draw blaster. Some who noticed Bulduga's low slung holster, red-lensed goggles and wide-brimmed hat wondered if perhaps Bulduga was a copy-cat, looking to imitate another well known gunslinger -- but not within earshot of the deadly Ithorian."
  },
  {
    "title": "Gliding Lizard of Zygerria",
    "height": "9.3 meters tall, 6.2 meters wide, 10.2 meters long",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/brezak_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "brezak",
    "gender": "",
    "homeworld": "Zygerria",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/brezak_detail.png",
    "biography": "The light-bodied brezak is a species of large lizard with skin flaps that, when extended, allow the beast to glide on the air currents surrounding the mesas of Zygerria. Domesticated brezaks are used by the royal Zygerrian guards to patrol the ground for escaped slaves. The beast's skin flaps are anchored to a flexible rib cage that allow the brezak to spread them wide. Its flat tail serves as a rudder, giving the animal -- and a capable rider -- a remarkable degree of control in the air."
  },
  {
    "title": "Big Boss of the Gungans",
    "height": "2.06 meters",
    "species": "Gungan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bossnass_thumb.jpg",
    "vehicle": "Heyblibber sumbarine",
    "weapon": "",
    "name": "Boss Nass",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Gungan Rep Council",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bossnass_detail.png",
    "biography": "The stout and stern leader of the Gungans, Boss Nass was a proud keeper of his people's ways. His booming voice issued decrees on behalf of all the Gungans of Otoh Gunga. He kept a tight rein on Gungan affairs, continuing a longstanding custom of isolationism. Ages ago, a cultural misunderstanding led to a rift between the Gungan and the Naboo colonists. This tension was perpetuated by stubbornness and ignorance on both sides.\nThough Nass' temper is short, he is not entirely close-minded. Displays of courage and humility can pierce through his preconceptions. When Queen Amidala prostrated herself before the Gungan leader to request his aid in fighting off the Trade Federation invasion, he was impressed. The Naboo didn't consider themselves superior to the Gungans, after all.\nNass committed the Gungan Grand Army to wage war against invading battle droids. When the Trade Federation was repulsed from Naboo, Nass joined Amidala in a huge celebratory parade that united the Naboo and the Gungans in a new era of peace and cooperation."
  },
  {
    "title": "Leader of the Gungans",
    "height": "2.22 meters",
    "species": "Gungan",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bosslyonie_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Boss Lyonie",
    "gender": "Male",
    "homeworld": "Naboo",
    "affiliation": "Gungan Rep Council",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bosslyonie_detail.png",
    "biography": "During the Clone Wars, Boss Lyonie served as the local leader of the Gungans of Naboo, chairing the Rep Council in Otoh Gunga. When the Republic needed reinforcements to prevent the Separatist takeover of Mon Cala, the Jedi Council asked Boss Lyonie to send in the Gungan Grand Army. Jar Jar Binks was quick to insist the Gungans help, especially since their loyal ally Senator Amidala was endangered.\nThough Lyonie proved a boon to the Republic during that campaign, a sudden tide of unrest among the Gungans against the Naboo caused many to fear that he would be siding with the Separatists."
  },
  {
    "title": "Trandoshan Bounty Hunter",
    "height": "2.08 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bossk_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "Bossk",
    "gender": "",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bossk_detail.png",
    "biography": "One of the most feared bounty hunters of the galaxy, Bossk used his natural Trandoshan hunting instincts to capture his prey. A fierce warrior, Bossk has long been surviving -- and excelling -- in the cutthroat world of professional predators. During the Clone Wars, the red-eyed reptilian partnered with Aurra Sing, Castas and young Boba Fett. The elder hunters helped Fett carry out a simmering plan of vengeance against the Jedi Master who killed Jango Fett. Bossk didn't care much for vendettas or politics. He was in it to get paid. Decades later, Bossk answered Darth Vader's call to capture the Millennium Falcon after the Battle of Hoth."
  },
  {
    "title": "Ill-fated Jedi Master",
    "height": "1.75 meters",
    "species": "Rodian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bollaropal_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Bolla Ropal",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bollaropal_detail.png",
    "biography": "Bolla Ropal was the keeper of the Kyber Crystal, which stored the identities of Force-sensitive children known to the Jedi. After stealing a Holocron from the Jedi Temple on Coruscant, the bounty hunter Cad Bane captured Ropal.\nTo access the information about Jedi children, Bane needed Ropal to open the Holocron, into which he'd insert the crystal. Ropal refused despite being tortured by Bane's battle droids, sacrificing his own life to thwart the bounty hunter's plans."
  },
  {
    "title": "Death Watch Warrior",
    "height": "1.8 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bokatan_thumb.jpg",
    "vehicle": "Rocket pack",
    "weapon": "Blaster pistol, dart launchers, gauntlet-blades",
    "name": "Bo-Katan",
    "gender": "Female",
    "homeworld": "Mandalore",
    "affiliation": "Death Watch",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bokatan_detail.png",
    "biography": "A fierce warrior concealed in sleek Mandalorian armor, Bo-Katan was the ever-loyal lieutenant to Pre Vizsla, and a proud member of the Death Watch splinter group. Bo-Katan rallied to Death Watch's call for Mandalorians to embrace their martial heritage and find glory in war. She was confident, sardonic, and deadly."
  },
  {
    "title": "Waxer's Brother in Arms",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/boil_thumb.jpg",
    "vehicle": "Republic attack gunship, AT-RT walker",
    "weapon": "Blaster rifle",
    "name": "Boil",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/boil_detail.png",
    "biography": "When trooper Waxer was en route to Ryloth on a mission to liberate its besieged population of Twi'leks, he was at first callously dismissive of their plight. \"If we're here to free the tail-heads, the least they can do is get out of our way,\" he said. But, time spent on the planet with a brave little survivor of a Nabat village opened Boil's eyes. The resourceful girl, Numa, guided Boil and his squadmate Waxer through hidden passageways beneath the village, which proved crucial in freeing hostages held by the Separatists. To honor Numa, Boil had a cartoon illustration of Numa added to his helmet."
  },
  {
    "title": "The Best Bounty Hunter in the Galaxy",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bobafett_thumb.jpg",
    "vehicle": "Slave I, rocket pack",
    "weapon": "Blaster rifle, flame projector, rocket darts, vibroblade",
    "name": "Boba Fett",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bobafett_detail.png",
    "biography": "A faceless enforcer, Boba Fett's distinctive, customized Mandalorian armor strikes fear in the hearts of fugitives. He is a legendary bounty hunter, accepting warrants from both the Empire and the criminal underworld. He is all business, laconic, and deadly.\nFett has carefully guarded his past, cultivating a curtain of mystery around his origins. He is in truth a clone, an exact genetic replica of his highly skilled \"father,\" Jango Fett. From Jango, Boba learned valuable survival and martial skills, and even as a child he was proficient with a blaster or laser cannon. With Jango's death at the hand of Jedi Knight Mace Windu, Boba would forever harbor a deep hatred for the Jedi and their allies."
  },
  {
    "title": "Tentacled Terror",
    "height": "6.48 meters tall, 5.67 meters wide, 13.33 meters long",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/blixus_thumb.jpg",
    "vehicle": "",
    "weapon": "",
    "name": "blixus",
    "gender": "",
    "homeworld": "",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/blixus_detail.png",
    "biography": "A horrific half-shelled monstrosity, the blixus is a rare beast that is regarded a prize to most collectors, as long as they are able to void the reach of its deadly tentacles.The blixus is coated with an articulated carapace, and hard chitin covers its six pick-like legs. Its well-muscled underbelly conceals a ghastly gash of a mouth filled with sharp teeth, and a pair of pincer-tipped graspers. Its most terrifying feature, though, are the five sinewy tentacles that terminate in sucker-lined grasping pads."
  },
  {
    "title": "Luckless Racer",
    "height": "1.63 meters",
    "species": "Toong",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/benquadinaros_thumb.jpg",
    "vehicle": "Balta-Trabaat BT310 quadra-Podracer",
    "weapon": "",
    "name": "Ben Quadinaros",
    "gender": "Male",
    "homeworld": "Tund system",
    "affiliation": "Boonta Eve Podracers",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/benquadinaros_detail.png",
    "biography": "The pudgy, comic-faced Ben Quadinaros was a rookie Podracer who claimed he came from the mysterious Tund system. He competed in the Boonta Eve Podrace that saw the liberation of Anakin Skywalker from slavery. Ben was largely inexperienced, and was quite terrified of the Boonta race. At the start of the race, his engines wouldn't even ignite. It was not until most of his competitors were already heading towards their second lap that his four engines did light -- just as his power couplings shorted, sending the rockets flying about the arena."
  },
  {
    "title": "Cobbled-Together Combatant",
    "height": "3.39 meters",
    "species": "",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/battledroid513_thumb.jpg",
    "vehicle": "",
    "weapon": "Twin blaster cannons",
    "name": "battle droid 513",
    "gender": "",
    "homeworld": "",
    "affiliation": "Formerly Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/battledroid513_detail.png",
    "biography": "The nomadic Death Watch terrorists from Mandalore kept up their fighting skills by blasting apart dwindling reserves of captured droids. The cruel warriors would delight in picking apart the writhing automatons. Death Watch would then rebuild the droids, without bothering to wipe their memories of their torturous demise. Battle droid 513 consisted of parts cobbled together from a Retail Caucus droid, a standard battle droid, and a crab droid. Its deep-voiced vocodor begged for pity or release from its merciless masters."
  },
  {
    "title": "Senator from Alderaan",
    "height": "1.99 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bailorgana_thumb.jpg",
    "vehicle": "Speeder, Alderaanian cruiser",
    "weapon": "Blaster pistol",
    "name": "Bail Organa",
    "gender": "Male",
    "homeworld": "Alderaan",
    "affiliation": "Galactic Republic, Galactic Senate, Rebel Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/bailorgana_detail.png",
    "biography": "Bail Organa, a member of Alderaan's royal family and the planet's representative to the Republic Senate, earned respect on Coruscant for his honesty and his commitment to justice. Prior to the Clone Wars, Bail served alongside Senator Padme Amidala as a member of Chancellor Palpatine's Loyalist Committee. The two became close friends, and recruited like-minded allies to prevent Palpatine's alarming grabs for power. At the end of the war, Bail Organa adopted Padme's daughter Leia and raised her as an Alderaanian princess. Bail died when the Death Star destroyed his homeworld."
  },
  {
    "title": "Ruthless Bounty Hunter",
    "height": "1.83 meters",
    "species": "Unknown",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/aurrasing_thumb.jpg",
    "vehicle": "Slave I (borrowed)",
    "weapon": "Blaster sniper rifle, paired blaster pistols",
    "name": "Aurra Sing",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Bounty hunter",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/aurrasing_detail.png",
    "biography": "A feared bounty hunter known for her chalk-white skin and built-in comlink antenna, Aurra Sing was an expert sniper and trained assassin who will work for anyone who pays her.\nAfter the death of Jango Fett, Aurra trained Boba Fett as a bounty hunter, teaching him the skills -- and the ruthlessness -- that he would need in pursuing his deadly profession."
  },
  {
    "title": "Prime Minister of Zygerria",
    "height": "",
    "species": "Zygerrian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ataimolec_thumb.jpg",
    "vehicle": "Zygerrian slave ship",
    "weapon": "electro-whip",
    "name": "Atai Molec",
    "gender": "",
    "homeworld": "Zygerria",
    "affiliation": "Zygerrian Slave Empire, Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ataimolec_detail.png",
    "biography": "Atai Molec is the ruthless prime minister of Zygerria who will do whatever it takes to bring his homeworld back to its former majesty. He also serves as Captain of the Guard, leading the royal sentinels sworn to protect the Queen and enforce Zygerrian dominance over their slaves. Despite his rank, Molec often took a hands-on approach. He has been known to personally prowl the markets on foot, vigiliant for any inklings of rebellion, and he delights in breaking slaves himself, brandishing the Zygerrian electro-whip with unrivaled cruelty."
  },
  {
    "title": "Dark Side Assassin",
    "height": "1.79 meters",
    "species": "Dathomirian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/asajjventress_thumb.jpg",
    "vehicle": "Fanblade starfighter, Trident ship",
    "weapon": "Twin lightsabers",
    "name": "Asajj Ventress",
    "gender": "Female",
    "homeworld": "Dathomir",
    "affiliation": "Nightsisters",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/asajjventress_detail.png",
    "biography": "An assassin trained in the ways of the dark side by Count Dooku, Asajj Ventress yearned to be considered a true Sith, but such status wasn't allowed under the Sith's Rule of Two. Ventress fought with twin sabers, and clashed with Obi-Wan Kenobi and Anakin Skywalker many times.\nVentress served Dooku faithfully, but the Count betrayed her as a demonstration of loyalty to Darth Sidious, telling his own troops to turn their guns on her. She returned to Dathomir, where she sought revenge with the help of her people, the mysterious Nightsisters."
  },
  {
    "title": "Traitor to the Republic",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/argyus_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster rifle",
    "name": "Captain Argyus",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Senate Guard",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/argyus_detail.png",
    "biography": "A member of the elite Senate Guard commandos, Captain Argyus was tasked with overseeing the transport of an important Republic prisoner: Separatist mastermind Nute Gunray. Gunray's wealth and the careful manipulation of Darth Sidious ensured that Argyus' loyalties wandered. Argyus betrayed the Republic, and ensured Gunray's escape from the cruiser Tranquility."
  },
  {
    "title": "Special Forces ARC Trooper",
    "height": "1.83 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/arctrooperfives_thumb.jpg",
    "vehicle": "",
    "weapon": "Blaster rifle, blaster pistols",
    "name": "ARC Trooper Fives",
    "gender": "Male",
    "homeworld": "Kamino",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/arctrooperfives_detail.png",
    "biography": "Also known as CT-27-5555, Fives trained with Domino Squad on Kamino before being shipped out to the Rishi Moon listening outpost. He survived the Separatist attack on the station there, and was transferred to the 501st Legion alongside his squadmate and fellow survivor, Echo. Fives and Echo were promoted to ARC trooper status after the defense of Kamino from Separatist invaders.\nHe and Echo were later assigned with the difficult mission of freeing Republic prisoners from the daunting Citadel prison installation on Lola Sayu. Though Fives survived that arduous assignment, Echo tragically fell in battle, leaving Fives as the sole survivor of the Domino Squad training squad."
  },
  {
    "title": "The Chosen One",
    "height": "1.88 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/anakinskywalker_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Anakin Skywalker",
    "gender": "",
    "homeworld": "Tatooine",
    "affiliation": "",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/anakinskywalker_detail.png",
    "biography": "The Jedi Order discovered Anakin Skywalker as a slave boy on Tatooine. He had the potential to be the most powerful Force-user ever, and perhaps was even the Chosen One of an ancient Jedi prophecy. Apprenticed to Obi-Wan Kenobi, Anakin was a headstrong and challenging Padawan learner. Despite the strict rules of the Jedi Code, he fell in love with and secretly married Senator Padme Amidala.\nAt the onset of the Clone Wars, the Jedi Council quickly promoted him to Jedi Knight. A daring pilot and a skilled warrior, Anakin's confidence is his greatest asset, and, at times, also his greatest liability. In an effort to teach him responsibility, Master Yoda gave Anakin a Padawan learner: young Ahsoka Tano. Though their relationship was stormy at first, Anakin and his apprentice quickly found a common ground."
  },
  {
    "title": "Prime Minister of Mandalore",
    "height": "1.89 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/almec_thumb.jpg",
    "vehicle": "",
    "weapon": "Electro-collar",
    "name": "Prime Minister Almec",
    "gender": "Male",
    "homeworld": "Mandalore",
    "affiliation": "Neutral",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/almec_detail.png",
    "biography": "As Prime Minister of Mandalore during the Clone Wars, Almec claimed loyalty to Duchess Satine Kryze and her controversial campaign of neutrality and pacifism. Almec saw Mandalore's violent past as shameful, and feared that the return of the armored warriors of Death Watch would be unstoppable. Though Almec loudly said that he valued the sanctity of Mandalorians above all else, his politician's grin and careful words concealed a different agenda."
  },
  {
    "title": "Apprentice to the Chosen One",
    "height": "1.7 meters",
    "species": "Togruta",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ahsokatano_thumb.jpg",
    "vehicle": "Jedi starfighter",
    "weapon": "Paired lightsabers",
    "name": "Ahsoka Tano",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ahsokatano_detail.png",
    "biography": "During the Clone Wars, Ahsoka Tano was Anakin Skywalker's Padawan learner, his apprentice in the ways of the Force. The young Togruta girl was discovered by Master Plo Koon and raised in the Jedi Temple. She graduated to Padawan at an early age, in part, as an effort by Master Yoda to teach her new Master, Anakin Skywalker, a greater sense of responsibility. Ahsoka is eager -- almost overly so -- to prove herself worthy of her status as a Padawan, to make Anakin proud, and to become a Jedi Knight."
  },
  {
    "title": "Legendary Commander",
    "height": "1.89 meters",
    "species": "Harch",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/admiraltrench_thumb.jpg",
    "vehicle": "Separatist dreadnaught",
    "weapon": "swagger stick",
    "name": "Admiral Trench",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Separatist Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/admiraltrench_detail.png",
    "biography": "A Separatist admiral known for his cunning and ruthlessness, Trench commanded the Separatist blockade of Christophsis, where Senator Bail Organa and his relief effort were pinned down and in danger of capture.\nAnakin Skywalker sought to break Trench's blockade by attacking his flagship with a cloaked stealth ship created by Republic engineers."
  },
  {
    "title": "Endurance Fleet Officer",
    "height": "1.72 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/admiralkilian_thumb.jpg",
    "vehicle": "Republic attack cruiser",
    "weapon": "Blaster pistol",
    "name": "Admiral Kilian",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/admiralkilian_detail.png",
    "biography": "A by-the-manuals Republic officer, Admiral Kilian runs a tight ship. Nonetheless, a saboteur was able to slip into the clone cadet ranks during a training tour over Vanqor, and cripple the Jedi cruiser Endurance. Kilian, following naval tradition, refused to abandon ship. He became a hostage of notorious bounty hunters seeking revenge against the Jedi Order."
  },
  {
    "title": "Galactic Republic Fleet Officer",
    "height": "1.81 meters",
    "species": "Human",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/admiralcoburn_thumb.jpg",
    "vehicle": "Republic attack cruiser, Jedi light cruiser",
    "weapon": "",
    "name": "Admiral Coburn",
    "gender": "Male",
    "homeworld": "",
    "affiliation": "Galactic Republic",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/admiralcoburn_detail.png",
    "biography": "With a stern face, steely glare and unmistakable command presence, Admiral Coburn served at the side of General Plo Koon during the Clone Wars. The taciturn fleet officer measured his words precisely, offering clear commands in a clipped accent. Coburn's rigid military discipline served him well in executing some of the more daring missions under Jedi leadership. He commanded a four-cruiser task force into the thick of a Separatist fleet cordon over Lola Sayu to facilitate the rescue of a strike team that invaded the Citadel installation. Coburn also led a Jedi light cruiser in extracting prisoners from the Zygerrian slave processing facility on Kadavo, steering the vessel dangerously close the facility."
  },
  {
    "title": "Tholothian Jedi Master",
    "height": "1.74 meters",
    "species": "Tolothian",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/adigallia_thumb.jpg",
    "vehicle": "Jedi starfighter",
    "weapon": "Lightsaber",
    "name": "Adi Gallia",
    "gender": "Female",
    "homeworld": "",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/adigallia_detail.png",
    "biography": "Jedi Master Adi Gallia was a member of the order's High Council during the Clone Wars. She and the other members of that ruling body would convene in a temple high above the Coruscant landscape, deciding important matters of the Jedi. Gallia served on the Council when Jedi Master Qui-Gon Jinn presented Anakin Skywalker to be trained. She watched the boy mature into a legendary warrior, and fought alongside him on important missions in the Clone Wars."
  },
  {
    "title": "Rebel Fleet Commander",
    "height": "1.8 meters",
    "species": "Mon Calamari",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ackbar_thumb.jpg",
    "vehicle": "Mon Calamari star cruiser",
    "weapon": "Blaster pistol",
    "name": "Ackbar",
    "gender": "Male",
    "homeworld": "Mon Cala",
    "affiliation": "Galactic Republic, Rebel Alliance",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/ackbar_detail.png",
    "biography": "A veteran commander, Ackbar led the defense of his oceanic home world, Mon Cala, during the Clone Wars, and the Rebel cruiser assault of the Battle of Endor during the war against the Empire. A Mon Calamari, Ackbar and his people manned the distinctive warships supplied to the Rebellion by that aquatic culture.\nBeyond the qualifications of his great skills and sterling character, Ackbar was a symbol to the rest of the galaxy that the Alliance is fighting for everyone, no matter what their background or origin. The Empire, in contrast, routinely subjugated non-humans."
  },
  {
    "title": "Twi'lek Jedi Knight",
    "height": "1.7 meters",
    "species": "Twi'lek",
    "thumbnailUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/aaylasecura_thumb.jpg",
    "vehicle": "",
    "weapon": "Lightsaber",
    "name": "Aayla Secura ",
    "gender": "Female",
    "homeworld": "Ryloth",
    "affiliation": "Jedi Order",
    "photoUrl": "http://www.starwars.com/img/explore/encyclopedia/characters/aaylasecura_detail.png",
    "biography": "With an athletic build, an exotic beauty, and blue skin, Aayla Secura stood out among the many faces of the Jedi ranks. She was a Jedi Knight during the rise of the Clone Wars. A cunning warrior, Aayla fights alongside Clone Commander Bly on many exotic battlefields. Having mastered the emotional detachment necessary in the Jedi Order, she tries to pass on what she has learned to others."
  }
]